rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static const AppAI_ModelStageSpec app_ai_obb_stage = {
	.stage_label = "obb",
	.model_image_path = APP_AI_OBB_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_mobilenetv2_obb_longterm,
	.network_init_fn = LL_ATON_EC_Network_Init_mobilenetv2_obb_longterm,
	.inference_init_fn = LL_ATON_EC_Inference_Init_mobilenetv2_obb_longterm,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_OBB_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_OBB_BASE_ADDR,
};

static const AppAI_ModelStageSpec app_ai_source_crop_box_stage = {
	.stage_label = "source_crop_box",
	.model_image_path = APP_AI_SOURCE_CROP_BOX_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_mobilenetv2_source_crop_box_v1_stripped_int8,
	.network_init_fn = LL_ATON_EC_Network_Init_mobilenetv2_source_crop_box_v1_stripped_int8,
	.inference_init_fn = LL_ATON_EC_Inference_Init_mobilenetv2_source_crop_box_v1_stripped_int8,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_SOURCE_CROP_BOX_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_SOURCE_CROP_BOX_BASE_ADDR,
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */
static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_GetStageInputBufferInfo(
	const AppAI_ModelStageSpec *stage);
static const LL_Buffer_InfoTypeDef *AppAI_GetStageOutputBufferInfo(
	const AppAI_ModelStageSpec *stage);
static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *name);
static const LL_Buffer_InfoTypeDef *AppAI_FindFirstBufferInfoByNames(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *const *names,
	size_t name_count);
static void AppAI_LogInitFailure(const char *step);
static void AppAI_LogXspi2LoadFailure(const char *step, UINT fx_status,
									  int32_t bsp_status);
static void AppAI_LogXspi2ProgramChunkProgress(ULONG chunk_index,
											   ULONG flash_offset, ULONG chunk_size);
static void AppAI_LogXspi2FlashStatus(const char *label);
static void AppAI_LogXspi2PrefixBytes(const char *label,
									  const uint8_t *bytes);
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
									size_t frame_size);
static void AppAI_LogInputSignature(const float *input_buffer,
									size_t input_float_count);
static void AppAI_LogInputTensorWindow(const float *input_buffer,
									   size_t input_float_count);
static void AppAI_LogInputProbeSummary(const float *input_buffer,
									   size_t input_float_count);
static void AppAI_LogTensorRowSamples(const char *label,
									  const float *input_buffer, size_t tensor_width, size_t row_y,
									  size_t x_min, size_t x_max);
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
								 size_t frame_width_pixels, size_t center_x, size_t center_y,
								 size_t radius_pixels);
static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
								 size_t tensor_width, size_t center_x, size_t center_y,
								 size_t radius_pixels);
static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
									  size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
									  size_t crop_x_min, size_t crop_y_min, size_t crop_width,
									  size_t crop_height);
static void AppAI_LogInt8BufferSignature(const char *label,
										 const int8_t *buffer_ptr, size_t buffer_len_bytes);
static void AppAI_LogRawBufferSignature(const char *label,
										const uint8_t *buffer_ptr, size_t buffer_len_bytes);
static const char *AppAI_BufferTypeName(const LL_Buffer_InfoTypeDef *buffer_info);
static void AppAI_LogBufferInfoAndSignature(const char *label,
											const LL_Buffer_InfoTypeDef *buffer_info);
static void AppAI_LogBufferPreview(const char *label,
								   const LL_Buffer_InfoTypeDef *buffer_info);
static void AppAI_LogScalarInternalOutputProbe(
	const AppAI_ModelStageSpec *stage,
	const LL_Buffer_InfoTypeDef *stage_output_info);
#if APP_AI_USE_ADAPTIVE_GAUGE_CROP
static bool AppAI_EstimateGaugeCropBoxFromYuv422(const uint8_t *frame_bytes,
												 size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
												 size_t *crop_x_min, size_t *crop_y_min, size_t *crop_width,
												 size_t *crop_height);
#endif
static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr);
static bool AppAI_ReadXspi2ModelSourceProbes(FX_FILE *model_file_ptr,
											 ULONG file_size, uint8_t *source_prefix, uint8_t *source_tail,
											 bool *has_tail_out);
static void AppAI_LogXspi2FlashPrefix(void);
static void AppAI_LogXspi2MappedScaleBytes(void);
static void AppAI_LogXspi2IndirectAndMappedPrefix(void);
static void AppAI_LogFloatApprox(const char *label, float value);
static float AppAI_TraceAndApplyInferenceCalibration(float raw_value);
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
static void AppAI_ResetInferenceBurstHistory(void);
#endif
static bool AppAI_IsFiniteFloat(float value);
static bool AppAI_IsPlausibleInferenceValue(float value);
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
static float AppAI_FilterInferenceValue(float value);
#endif
static void AppAI_LogInferenceResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info);
static void AppAI_LogRectifierResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	const AppAI_RectifierBox *rectifier_box);
static void AppAI_LogObbResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	const AppAI_ObbBox *obb_box);
static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
								 bool clean, bool invalidate);
static uint32_t AppAI_GrayToFloatBits(uint8_t gray);

static bool __attribute__((noinline)) AppAI_PreprocessScalarRow(
	const uint8_t *frame_bytes, size_t frame_size, size_t source_width,
	size_t source_height, size_t crop_x_min, size_t crop_y_min,
	size_t crop_width, size_t crop_height, size_t output_width,
	size_t output_height, float resize_scale, size_t resized_width,
	size_t resized_height, size_t resize_pad_x, size_t resize_pad_y,
	size_t out_y, float *input_ptr, size_t input_len_bytes);
static void AppAI_EnableNpuMemoryAndCaches(void);
static void AppAI_ConfigureNpuAccessControl(void);
static void AppAI_ConfigureNpuRisafDefaults(void);
static bool AppAI_EnsureStageRuntimeReady(const AppAI_ModelStageSpec *stage);
static bool AppAI_EnsureXspi2ModelImageReadyForStage(
	const AppAI_ModelStageSpec *stage);
static bool AppAI_WaitForFileXMediaReady(uint32_t timeout_ms);
static bool AppAI_RuntimeInitStepwise(void);
static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToFloatInput(
	const uint8_t *frame_bytes, size_t frame_size, float *input_buffer,
	size_t input_float_count, size_t input_len_bytes);
static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToInt8Input(
	const uint8_t *frame_bytes, size_t frame_size, uint8_t *input_ptr,
	size_t input_len_bytes, const LL_Buffer_InfoTypeDef *input_info);
static float AppAI_ClampNormalizedFloat(float value);
static uint32_t AppAI_GrayToFloatBits(uint8_t gray)
{
	/* Convert luma to a normalized float32 payload without reserving extra RAM. */
	union
	{
		float f;
		uint32_t u;
	} gray_value = {
		.f = ((float)gray) * (1.0f / 255.0f)};

	return gray_value.u;
}
static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
									size_t frame_size_bytes,
									size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadYuv422Quartet(const uint8_t *frame_bytes,
									size_t frame_size_bytes,
									size_t frame_width_pixels, size_t source_x, size_t source_y,
									uint8_t *quad_out);
static float AppAI_ReadNormalizedGrayFromYuv422Pixel(const uint8_t *frame_bytes,
													 size_t frame_size_bytes,
													 size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadRgbFromYuv422Pixel(const uint8_t *frame_bytes,
										 size_t frame_size_bytes,
										 size_t frame_width_pixels, size_t source_x, size_t source_y,
										 float *r_out, float *g_out, float *b_out);
static void AppAI_ReadRgbFromYuv422Bilinear(const uint8_t *frame_bytes,
											size_t frame_size_bytes,
											size_t frame_width_pixels,
											size_t frame_height_pixels,
											float source_x, float source_y,
											float *r_out, float *g_out, float *b_out);
static void AppAI_ReadRgbFromRgbBilinear(const uint8_t *rgb_bytes,
										 size_t frame_width_pixels,
										 size_t frame_height_pixels,
										 float source_x, float source_y,
										 float *r_out, float *g_out, float *b_out);
static uint8_t AppAI_FindHistogramPercentile(const uint32_t *histogram,
											 size_t histogram_len,
											 uint32_t total_count,
											 float percentile);
static float AppAI_ScorePolarAlignmentCandidate(
	const uint8_t *resized_rgb,
	size_t output_dim,
	float center_x,
	float center_y,
	float max_radius,
	uint8_t *polar_luma_out);
static void AppAI_SetForcedCrop(const char *label, size_t x_min,
								size_t y_min, size_t width, size_t height);
static void AppAI_ClearForcedCrop(void);
static bool AppAI_DecodeObbCropBox(const LL_Buffer_InfoTypeDef *output_buffer_info,
								   AppAI_SourceCrop *crop_out, AppAI_ObbBox *obb_box_out);
static bool AppAI_DecodeSourceCropBox(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	AppAI_SourceCrop *crop_out,
	AppAI_SourceCropBox *box_out);
static bool AppAI_DecodeRectifierCropBox(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	AppAI_SourceCrop *crop_out,
	AppAI_RectifierBox *rectifier_box_out);
#if !defined(APP_AI_DISABLE_LEGACY_TOPK_DECODE)
static bool AppAI_DecodeScalarTopKExpectationFromOutput(
	const LL_Buffer_InfoTypeDef *output_info,
	const uint8_t *output_ptr,
	size_t output_len_bytes,
	float *decoded_value_out);
#endif /* !APP_AI_DISABLE_LEGACY_TOPK_DECODE */
static bool AppAI_DecodeCircularVoteFromOutput(
	const uint8_t *output_ptr,
	size_t output_len_bytes,
	float *decoded_value_out);
static bool AppAI_PreprocessYuv422FrameToPolarInput(
	const uint8_t *frame_bytes, size_t frame_size,
	uint8_t *input_ptr, size_t input_len_bytes,
	const LL_Buffer_InfoTypeDef *input_info);
int mcu_cache_clean_range(uint32_t start_addr, uint32_t end_addr)
{
	return AppAI_ApplyCacheRange(start_addr, end_addr, true, false);
}

int mcu_cache_invalidate_range(uint32_t start_addr, uint32_t end_addr)
{
	return AppAI_ApplyCacheRange(start_addr, end_addr, false, true);
}

