rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static bool AppAI_EnsureNpuHardwareReady(void)
{
	if (app_ai_npu_hw_initialized)
	{
		return true;
	}

	(void)DebugConsole_WriteString("[AI] NPU hardware bring-up start.\r\n");
	__HAL_RCC_NPU_CLK_ENABLE();
	__HAL_RCC_NPU_FORCE_RESET();
	__HAL_RCC_NPU_RELEASE_RESET();
	__HAL_RCC_NPU_CLK_SLEEP_DISABLE();

	__HAL_RCC_CACHEAXI_CLK_ENABLE();
	__HAL_RCC_CACHEAXI_FORCE_RESET();
	__HAL_RCC_CACHEAXI_RELEASE_RESET();
	__HAL_RCC_CACHEAXI_CLK_SLEEP_DISABLE();

	AppAI_EnableNpuMemoryAndCaches();

	npu_cache_init();
	npu_cache_enable();

	AppAI_ConfigureNpuAccessControl();
	AppAI_ConfigureNpuRisafDefaults();

	app_ai_npu_hw_initialized = true;
	(void)DebugConsole_WriteString("[AI] NPU hardware bring-up OK.\r\n");
	return true;
}

static bool AppAI_EnsureXspi2MemoryReady(void)
{
	BSP_XSPI_NOR_Init_t flash = {0};
	RCC_PeriphCLKInitTypeDef periph_clk = {0};
	int32_t bsp_status = BSP_ERROR_NONE;

	if (app_ai_xspi2_initialized)
	{
		return true;
	}

	(void)DebugConsole_WriteString("[AI] XSPI2 memory bring-up start.\r\n");
	/* If a prior verify attempt left the flash in memory-mapped mode, erase and
	 * write commands will fail.  Take it back to indirect mode first. DeInit
	 * handles this cleanly regardless of the current BSP context state. */
	(void)BSP_XSPI_NOR_DeInit(0U);
	app_ai_xspi2_mm_enabled = false;

	periph_clk.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
	periph_clk.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_IC3;
	if (HAL_RCCEx_PeriphCLKConfig(&periph_clk) != HAL_OK)
	{
		(void)DebugConsole_WriteString("[AI] XSPI2 clock config failed.\r\n");
		return false;
	}

	/* Ensure the xSPI2 clock is enabled after configuration change.
	 * The deinit may have disabled the clock, and the new clock source
	 * won't be active until the peripheral clock enable is asserted. */
	XSPI_CLK_ENABLE();
	(void)DebugConsole_WriteString("[AI] XSPI2 clock enable OK.\r\n");

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	flash.TransferRate = BSP_XSPI_NOR_STR_TRANSFER;
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE)
	{
#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
		char msg[96];
		(void)DebugConsole_Snprintf(msg, sizeof(msg),
					   "[AI] BSP_XSPI_NOR_Init for provisioning failed: %ld\r\n",
					   (long)bsp_status);
		(void)DebugConsole_WriteString(msg);
#endif
		return false;
	}

	(void)DebugConsole_WriteString("[AI] XSPI2 memory bring-up OK.\r\n");
	return true;
}

static bool AppAI_ReconfigureXspi2ForRuntime(void)
{
	BSP_XSPI_NOR_Init_t flash = {0};
	RCC_PeriphCLKInitTypeDef periph_clk = {0};
	int32_t bsp_status = BSP_ERROR_NONE;

	/* Drop out of memory-mapped mode before changing the flash transfer rate.
	 * Clear the provisioning-mode guard so EnsureXspi2MemoryReady will
	 * re-initialize the peripheral into indirect/write mode if provisioning
	 * is needed again after this reconfigure. */
	app_ai_xspi2_initialized = false;
	app_ai_xspi2_mm_enabled = false;
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: disable MM start.\r\n");
	(void)BSP_XSPI_NOR_DisableMemoryMappedMode(0U);
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: disable MM OK.\r\n");
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: deinit start.\r\n");
	(void)BSP_XSPI_NOR_DeInit(0U);
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: deinit OK.\r\n");

	periph_clk.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
	periph_clk.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_IC3;
	(void)DebugConsole_WriteString(
		"[AI] xSPI2 runtime reconfigure: clock config start.\r\n");
	if (HAL_RCCEx_PeriphCLKConfig(&periph_clk) != HAL_OK)
	{
		DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: clock config failed.\r\n");
		return false;
	}
	(void)DebugConsole_WriteString(
		"[AI] xSPI2 runtime reconfigure: clock config OK.\r\n");

	/* Ensure the xSPI2 clock is enabled after configuration change.
	 * The deinit may have disabled the clock, and the new clock source
	 * won't be active until the peripheral clock enable is asserted. */
	XSPI_CLK_ENABLE();
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: clock enable OK.\r\n");

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	/* Keep the runtime in STR mode for now. The board already initializes and
	 * programs the xSPI2 NOR successfully in STR, while the DTR reconfigure
	 * path was failing during BSP_XSPI_NOR_Init() with -5. We only need the
	 * mapped window to be valid for the stage runtime. */
	flash.TransferRate = BSP_XSPI_NOR_STR_TRANSFER;
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: init start.\r\n");
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE)
	{
		char msg[96];
		(void)DebugConsole_Snprintf(msg, sizeof(msg),
					   "[AI] xSPI2 runtime reconfigure: init failed: %ld\r\n",
					   (long)bsp_status);
		DebugConsole_WriteString(msg);
		return false;
	}
	(void)DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: init OK.\r\n");

	/* Leave the peripheral in indirect mode so callers that need to probe flash
	 * via BSP_XSPI_NOR_Read can do so immediately.  Callers that need the
	 * memory-mapped window must call BSP_XSPI_NOR_EnableMemoryMappedMode()
	 * themselves after this function returns. */
	return true;
}

static bool AppAI_Xspi2EnableMemoryMappedMode(void)
{
	(void)DebugConsole_WriteString("[AI] xSPI2 enable MM start.\r\n");
	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE)
	{
		app_ai_xspi2_mm_enabled = false;
		(void)DebugConsole_WriteString("[AI] xSPI2 enable MM failed.\r\n");
		return false;
	}
	app_ai_xspi2_mm_enabled = true;
	(void)DebugConsole_WriteString("[AI] xSPI2 enable MM OK.\r\n");
	return true;
}

static bool AppAI_Xspi2ReadFlashProbe(const uint32_t chip_base_offset,
									  const uint32_t flash_offset,
									  const uint8_t *expected_bytes, const size_t expected_length)
{
	uint8_t flash_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};

	if ((expected_bytes == NULL) || (expected_length == 0U) || (expected_length > APP_AI_XSPI2_PROBE_BYTES))
	{
		return false;
	}

	if (BSP_XSPI_NOR_Read(0U, flash_bytes,
						  chip_base_offset + flash_offset,
						  (uint32_t)expected_length) != BSP_ERROR_NONE)
	{
		return false;
	}

	return (memcmp(flash_bytes, expected_bytes, expected_length) == 0);
}

static bool AppAI_Xspi2ReadMappedProbe(const uint32_t flash_offset,
									   const uint8_t *expected_bytes, const size_t expected_length)
{
	const uint8_t *const flash_ptr = (const uint8_t *)(APP_AI_XSPI2_MODEL_BASE_ADDR + flash_offset);

	if ((expected_bytes == NULL) || (expected_length == 0U) || (expected_length > APP_AI_XSPI2_PROBE_BYTES))
	{
		return false;
	}

	(void)mcu_cache_invalidate_range((uint32_t)flash_ptr,
									 (uint32_t)flash_ptr + (uint32_t)expected_length);

	return (memcmp(flash_ptr, expected_bytes, expected_length) == 0);
}

