rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static bool AppAI_Xspi2ReadStageProbe(const AppAI_ModelStageSpec *stage,
									  const uint32_t flash_offset,
									  const uint8_t *expected_bytes,
									  const size_t expected_length)
{
	if ((stage == NULL) || (expected_bytes == NULL) || (expected_length == 0U) ||
		(expected_length > APP_AI_XSPI2_PROBE_BYTES))
	{
		return false;
	}

	/* After stage provisioning we can already be back in memory-mapped mode.
	 * In that state, compare directly through the mapped stage window. */
	if (app_ai_xspi2_mm_enabled)
	{
		const uint8_t *const flash_ptr =
			(const uint8_t *)(stage->xspi2_base_addr + flash_offset);
		(void)mcu_cache_invalidate_range((uint32_t)(uintptr_t)flash_ptr,
										 (uint32_t)((uintptr_t)flash_ptr + (uint32_t)expected_length));
		return (memcmp(flash_ptr, expected_bytes, expected_length) == 0);
	}

	return AppAI_Xspi2ReadFlashProbe(stage->xspi2_chip_offset, flash_offset,
									 expected_bytes, expected_length);
}

#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogXspi2PrefixBytes(const char *label,
									  const uint8_t *bytes)
{
	if ((label == NULL) || (bytes == NULL))
	{
		return;
	}

	DebugConsole_Printf(
		"[AI] %s %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X\r\n",
		label, bytes[0], bytes[1], bytes[2], bytes[3], bytes[4], bytes[5],
		bytes[6], bytes[7], bytes[8], bytes[9], bytes[10], bytes[11],
		bytes[12], bytes[13], bytes[14], bytes[15]);
}

/**
 * @brief Print a compact signature for the captured input frame.
 *
 * This makes it easy to compare whether two runs actually fed different
 * camera data into the model.
 */
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
									size_t frame_size)
{
	uint8_t first_bytes[8U] = {0U};
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((frame_bytes == NULL) || (frame_size == 0U))
	{
		DebugConsole_Printf("[AI] Frame signature skipped: empty frame.\r\n");
		return;
	}

	preview_count = (frame_size < sizeof(first_bytes)) ? frame_size
													   : sizeof(first_bytes);
	for (size_t index = 0U; index < preview_count; index++)
	{
		first_bytes[index] = frame_bytes[index];
	}

	for (size_t index = 0U; index < frame_size; index++)
	{
		hash ^= frame_bytes[index];
		hash *= 16777619UL;
	}

	DebugConsole_Printf(
		"[AI] Frame signature: len=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
		(unsigned long)frame_size, (unsigned long)hash,
		(unsigned int)first_bytes[0], (unsigned int)first_bytes[1],
		(unsigned int)first_bytes[2], (unsigned int)first_bytes[3],
		(unsigned int)first_bytes[4], (unsigned int)first_bytes[5],
		(unsigned int)first_bytes[6], (unsigned int)first_bytes[7]);
}

/**
 * @brief Print a compact signature for the preprocessed model input tensor.
 *
 * This tells us whether the captured scene is still distinct after the
 * YUV422-to-RGB preprocessing and dial ROI crop.
 */
static void AppAI_LogInputSignature(const float *input_buffer,
									size_t input_float_count)
{
	const uint8_t *bytes = NULL;
	uint8_t first_bytes[8U] = {0U};
	uint32_t first_words[4U] = {0U};
	uint32_t hash = 2166136261UL;
	size_t byte_count = 0U;
	size_t preview_bytes = 0U;
	size_t preview_words = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((input_buffer == NULL) || (input_float_count == 0U))
	{
		DebugConsole_Printf("[AI] Input signature skipped: empty tensor.\r\n");
		return;
	}

	bytes = (const uint8_t *)input_buffer;
	byte_count = input_float_count * sizeof(float);
	preview_bytes = (byte_count < sizeof(first_bytes)) ? byte_count
													   : sizeof(first_bytes);
	preview_words = (input_float_count < 4U) ? input_float_count : 4U;

	for (size_t index = 0U; index < preview_bytes; index++)
	{
		first_bytes[index] = bytes[index];
	}

	for (size_t index = 0U; index < preview_words; index++)
	{
		(void)memcpy(&first_words[index], &input_buffer[index],
					 sizeof(uint32_t));
	}

	for (size_t index = 0U; index < byte_count; index++)
	{
		hash ^= bytes[index];
		hash *= 16777619UL;
	}

	DebugConsole_Printf(
		"[AI] Input signature: floats=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X] first4=[0x%08lX,0x%08lX,0x%08lX,0x%08lX]\r\n",
		(unsigned long)input_float_count, (unsigned long)hash,
		(unsigned int)first_bytes[0], (unsigned int)first_bytes[1],
		(unsigned int)first_bytes[2], (unsigned int)first_bytes[3],
		(unsigned int)first_bytes[4], (unsigned int)first_bytes[5],
		(unsigned int)first_bytes[6], (unsigned int)first_bytes[7],
		(unsigned long)first_words[0], (unsigned long)first_words[1],
		(unsigned long)first_words[2], (unsigned long)first_words[3]);
}

/**
 * @brief Print a small diagnostic window from the center of the input tensor.
 *
 * The top-left bytes can be padding or background, so this summary looks at the
 * tensor region where the dial should live after cropping and resizing.
 */
static void AppAI_LogInputTensorWindow(const float *input_buffer,
									   size_t input_float_count)
{
	const size_t tensor_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t tensor_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t center_x = tensor_width / 2U;
	const size_t center_y = tensor_height / 2U;
	const size_t window_radius = 8U;
	const size_t x_min = (center_x > window_radius) ? (center_x - window_radius)
													: 0U;
	const size_t y_min = (center_y > window_radius) ? (center_y - window_radius)
													: 0U;
	const size_t x_max = ((center_x + window_radius) < tensor_width) ? (center_x + window_radius) : tensor_width;
	const size_t y_max = ((center_y + window_radius) < tensor_height) ? (center_y + window_radius) : tensor_height;
	float sum_r = 0.0f;
	float sum_g = 0.0f;
	float sum_b = 0.0f;
	float min_r = 1.0f;
	float min_g = 1.0f;
	float min_b = 1.0f;
	float max_r = 0.0f;
	float max_g = 0.0f;
	float max_b = 0.0f;
	float center_r = 0.0f;
	float center_g = 0.0f;
	float center_b = 0.0f;
	unsigned long center_r_milli = 0U;
	unsigned long center_g_milli = 0U;
	unsigned long center_b_milli = 0U;
	unsigned long mean_r_milli = 0U;
	unsigned long mean_g_milli = 0U;
	unsigned long mean_b_milli = 0U;
	unsigned long min_r_milli = 0U;
	unsigned long min_g_milli = 0U;
	unsigned long min_b_milli = 0U;
	unsigned long max_r_milli = 0U;
	unsigned long max_g_milli = 0U;
	unsigned long max_b_milli = 0U;
	size_t sample_count = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((input_buffer == NULL) || (input_float_count < APP_AI_MODEL_INPUT_FLOAT_COUNT))
	{
		return;
	}

	for (size_t y = y_min; y < y_max; y++)
	{
		for (size_t x = x_min; x < x_max; x++)
		{
			const size_t pixel_index = (y * tensor_width) + x;
			const size_t base = pixel_index * 3U;
			const float r = input_buffer[base + 0U];
			const float g = input_buffer[base + 1U];
			const float b = input_buffer[base + 2U];

			if (r < min_r)
			{
				min_r = r;
			}
			if (g < min_g)
			{
				min_g = g;
			}
			if (b < min_b)
			{
				min_b = b;
			}
			if (r > max_r)
			{
				max_r = r;
			}
			if (g > max_g)
			{
				max_g = g;
			}
			if (b > max_b)
			{
				max_b = b;
			}

			sum_r += r;
			sum_g += g;
			sum_b += b;
			sample_count++;
		}
	}

	{
		const size_t center_base = ((center_y * tensor_width) + center_x) * 3U;
		center_r = input_buffer[center_base + 0U];
		center_g = input_buffer[center_base + 1U];
		center_b = input_buffer[center_base + 2U];
	}

	if (sample_count == 0U)
	{
		return;
	}

