rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	center_r_milli = (unsigned long)((center_r * 1000.0f) + 0.5f);
	center_g_milli = (unsigned long)((center_g * 1000.0f) + 0.5f);
	center_b_milli = (unsigned long)((center_b * 1000.0f) + 0.5f);
	mean_r_milli = (unsigned long)((sum_r / (float)sample_count) * 1000.0f + 0.5f);
	mean_g_milli = (unsigned long)((sum_g / (float)sample_count) * 1000.0f + 0.5f);
	mean_b_milli = (unsigned long)((sum_b / (float)sample_count) * 1000.0f + 0.5f);
	min_r_milli = (unsigned long)(min_r * 1000.0f + 0.5f);
	min_g_milli = (unsigned long)(min_g * 1000.0f + 0.5f);
	min_b_milli = (unsigned long)(min_b * 1000.0f + 0.5f);
	max_r_milli = (unsigned long)(max_r * 1000.0f + 0.5f);
	max_g_milli = (unsigned long)(max_g * 1000.0f + 0.5f);
	max_b_milli = (unsigned long)(max_b * 1000.0f + 0.5f);

	DebugConsole_Printf(
		"[AI] Tensor center window: x=[%lu,%lu) y=[%lu,%lu) center_milli=[%lu %lu %lu] mean_milli=[%lu %lu %lu] min_milli=[%lu %lu %lu] max_milli=[%lu %lu %lu]\r\n",
		(unsigned long)x_min, (unsigned long)x_max, (unsigned long)y_min,
		(unsigned long)y_max, center_r_milli, center_g_milli,
		center_b_milli, mean_r_milli, mean_g_milli, mean_b_milli,
		min_r_milli, min_g_milli, min_b_milli, max_r_milli, max_g_milli,
		max_b_milli);

	AppAI_LogTensorRowSamples("top", input_buffer, tensor_width,
							  y_min + ((y_max - y_min) / 4U), x_min, x_max);
	AppAI_LogTensorRowSamples("mid", input_buffer, tensor_width, center_y,
							  x_min, x_max);
	AppAI_LogTensorRowSamples("bottom", input_buffer, tensor_width,
							  y_min + (((y_max - y_min) * 3U) / 4U), x_min, x_max);
}

/**
 * @brief Print a compact fingerprint for the tensor that actually reaches the NPU.
 *
 * The disabled verbose tensor logs are useful in source, but this helper uses
 * direct console writes so we can see a stable per-frame summary on hardware.
 */
static void AppAI_LogInputProbeSummary(const float *input_buffer,
									   size_t input_float_count)
{
	const size_t tensor_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t tensor_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t sample_points[4U][2U] = {
		{tensor_width / 2U, tensor_height / 2U},
		{tensor_width / 2U, tensor_height / 4U},
		{tensor_width / 4U, tensor_height / 2U},
		{(tensor_width * 3U) / 4U, tensor_height / 2U},
	};
	const char *sample_labels[4U] = {
		"center",
		"top-mid",
		"left-mid",
		"right-mid",
	};
	const uint8_t *bytes = NULL;
	uint8_t first_bytes[8U] = {0U};
	uint32_t hash = 2166136261UL;
	uint32_t first_words[4U] = {0U};
	float sum_value = 0.0f;
	float min_value = 1.0f;
	float max_value = 0.0f;
	size_t active_count = 0U;
	size_t byte_count = 0U;
	size_t preview_bytes = 0U;
	size_t preview_words = 0U;

	if ((input_buffer == NULL) || (input_float_count < APP_AI_MODEL_INPUT_FLOAT_COUNT))
	{
		(void)DebugConsole_WriteString("[AI] Input probe skipped.\r\n");
		return;
	}

	bytes = (const uint8_t *)input_buffer;
	byte_count = input_float_count * sizeof(float);
	preview_bytes = (byte_count < sizeof(first_bytes)) ? byte_count
													   : sizeof(first_bytes);
	preview_words = (input_float_count < 4U) ? input_float_count : 4U;

	for (size_t index = 0U; index < preview_bytes; index++)
	{
		first_bytes[index] = bytes[index];
	}

	for (size_t index = 0U; index < preview_words; index++)
	{
		(void)memcpy(&first_words[index], &input_buffer[index],
					 sizeof(uint32_t));
	}

	for (size_t index = 0U; index < byte_count; index++)
	{
		hash ^= bytes[index];
		hash *= 16777619UL;
	}

	for (size_t index = 0U; index < input_float_count; index++)
	{
		const float value = input_buffer[index];

		sum_value += value;
		if (value < min_value)
		{
			min_value = value;
		}
		if (value > max_value)
		{
			max_value = value;
		}
		if ((value > 0.001f) || (value < -0.001f))
		{
			active_count++;
		}
	}

	{
		char line[224];
		(void)DebugConsole_Snprintf(line, sizeof(line),
					   "[AI] Input probe: floats=%lu bytes=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X] first4=[0x%08lX 0x%08lX 0x%08lX 0x%08lX]\r\n",
					   (unsigned long)input_float_count,
					   (unsigned long)byte_count, (unsigned long)hash,
					   (unsigned int)first_bytes[0], (unsigned int)first_bytes[1],
					   (unsigned int)first_bytes[2], (unsigned int)first_bytes[3],
					   (unsigned int)first_bytes[4], (unsigned int)first_bytes[5],
					   (unsigned int)first_bytes[6], (unsigned int)first_bytes[7],
					   (unsigned long)first_words[0], (unsigned long)first_words[1],
					   (unsigned long)first_words[2], (unsigned long)first_words[3]);
		(void)DebugConsole_WriteString(line);
	}

	{
		const unsigned long mean_milli =
			(unsigned long)(((sum_value / (float)input_float_count) * 1000.0f) + 0.5f);
		const unsigned long min_milli =
			(unsigned long)((min_value * 1000.0f) + 0.5f);
		const unsigned long max_milli =
			(unsigned long)((max_value * 1000.0f) + 0.5f);
		char line[192];

		(void)DebugConsole_Snprintf(line, sizeof(line),
					   "[AI] Input probe stats: active=%lu/%lu mean_milli=%lu min_milli=%lu max_milli=%lu\r\n",
					   (unsigned long)active_count, (unsigned long)input_float_count,
					   mean_milli, min_milli, max_milli);
		(void)DebugConsole_WriteString(line);
	}

	for (size_t index = 0U; index < 4U; index++)
	{
		const size_t sample_x = sample_points[index][0U];
		const size_t sample_y = sample_points[index][1U];
		const size_t pixel_index = (sample_y * tensor_width) + sample_x;
		const size_t base = pixel_index * 3U;
		const uint32_t r_bits = 0U;
		const uint32_t g_bits = 0U;
		const uint32_t b_bits = 0U;
		const unsigned long r_milli =
			(unsigned long)((input_buffer[base + 0U] * 1000.0f) + 0.5f);
		const unsigned long g_milli =
			(unsigned long)((input_buffer[base + 1U] * 1000.0f) + 0.5f);
		const unsigned long b_milli =
			(unsigned long)((input_buffer[base + 2U] * 1000.0f) + 0.5f);
		uint32_t sample_bits[3U] = {0U, 0U, 0U};
		char line[160];

		(void)memcpy(&sample_bits[0U], &input_buffer[base + 0U],
					 sizeof(uint32_t));
		(void)memcpy(&sample_bits[1U], &input_buffer[base + 1U],
					 sizeof(uint32_t));
		(void)memcpy(&sample_bits[2U], &input_buffer[base + 2U],
					 sizeof(uint32_t));

		(void)r_bits;
		(void)g_bits;
		(void)b_bits;

