rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	DebugConsole_Printf(
		"[AI] Source crop window: x=[%lu,%lu) y=[%lu,%lu) center_luma_milli=[%lu] mean_luma_milli=[%lu] min_luma_milli=[%lu] max_luma_milli=[%lu]\r\n",
		(unsigned long)x_min, (unsigned long)x_max, (unsigned long)y_min,
		(unsigned long)y_max, center_luma_milli, mean_luma_milli,
		min_luma_milli, max_luma_milli);

	AppAI_LogSourcePatch("Source crop center", frame_bytes, frame_width_pixels,
						 center_x, center_y, 2U);

	for (size_t index = 0U; index < 3U; ++index)
	{
		const char *label = (index == 0U)	? "src_top"
							: (index == 1U) ? "src_mid"
											: "src_bottom";
		const size_t row_y = (index == 0U)	 ? (y_min + ((y_max - y_min) / 4U))
							 : (index == 1U) ? center_y
											 : (y_min + (((y_max - y_min) * 3U) / 4U));
		const size_t sample_span = (x_max > x_min) ? (x_max - x_min - 1U) : 0U;
		const size_t sample_x0 = x_min;
		const size_t sample_x1 = x_min + (sample_span / 4U);
		const size_t sample_x2 = x_min + (sample_span / 2U);
		const size_t sample_x3 = x_min + ((sample_span * 3U) / 4U);
		const size_t sample_x4 = (x_max > 0U) ? (x_max - 1U) : 0U;
		const size_t sample_xs[5U] = {
			sample_x0, sample_x1, sample_x2, sample_x3, sample_x4};

		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long)row_y);
		for (size_t sample_index = 0U; sample_index < 5U; ++sample_index)
		{
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes, frame_size,
													  frame_width_pixels, sample_xs[sample_index], row_y);
			const unsigned long luma_milli =
				(unsigned long)((luma * 1000U) / 255U);

			DebugConsole_Printf(" x=%lu y=%lu",
								(unsigned long)sample_xs[sample_index], luma_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print a compact signature for an int8 tensor or activation buffer.
 *
 * This is useful for the model boundary because it tells us whether the
 * quantized activations are changing even when the final dequantized output is
 * still neutral.
 */
static void AppAI_LogInt8BufferSignature(const char *label,
										 const int8_t *buffer_ptr, size_t buffer_len_bytes)
{
	uint8_t first_bytes[16U] = {0U};
	int8_t min_value = 127;
	int8_t max_value = -128;
	uint32_t nonzero_count = 0U;
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((label == NULL) || (buffer_ptr == NULL) || (buffer_len_bytes == 0U))
	{
		DebugConsole_Printf(
			"[AI] %s int8 signature skipped: empty buffer.\r\n",
			(label != NULL) ? label : "(unnamed)");
		return;
	}

	preview_count = (buffer_len_bytes < sizeof(first_bytes)) ? buffer_len_bytes
															 : sizeof(first_bytes);

	for (size_t index = 0U; index < buffer_len_bytes; ++index)
	{
		const uint8_t raw_byte = (uint8_t)buffer_ptr[index];

		hash ^= raw_byte;
		hash *= 16777619UL;

		if (buffer_ptr[index] < min_value)
		{
			min_value = buffer_ptr[index];
		}
		if (buffer_ptr[index] > max_value)
		{
			max_value = buffer_ptr[index];
		}
		if (buffer_ptr[index] != 0)
		{
			nonzero_count++;
		}
		if (index < preview_count)
		{
			first_bytes[index] = raw_byte;
		}
	}

	DebugConsole_Printf(
		"[AI] %s int8 signature: bytes=%lu hash=0x%08lX nonzero=%lu min=%d max=%d first16=[%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
		label, (unsigned long)buffer_len_bytes, (unsigned long)hash,
		(unsigned long)nonzero_count, (int)min_value, (int)max_value,
		(unsigned int)first_bytes[0], (unsigned int)first_bytes[1],
		(unsigned int)first_bytes[2], (unsigned int)first_bytes[3],
		(unsigned int)first_bytes[4], (unsigned int)first_bytes[5],
		(unsigned int)first_bytes[6], (unsigned int)first_bytes[7],
		(unsigned int)first_bytes[8], (unsigned int)first_bytes[9],
		(unsigned int)first_bytes[10], (unsigned int)first_bytes[11],
		(unsigned int)first_bytes[12], (unsigned int)first_bytes[13],
		(unsigned int)first_bytes[14], (unsigned int)first_bytes[15]);
}

/**
 * @brief Print a compact signature for any buffer by raw bytes.
 *
 * This avoids guessing the tensor type when we just want to know whether the
 * runtime wrote anything other than zero into a model activation.
 */
static void AppAI_LogRawBufferSignature(const char *label,
										const uint8_t *buffer_ptr, size_t buffer_len_bytes)
{
	uint8_t first_bytes[16U] = {0U};
	uint8_t min_value = 255U;
	uint8_t max_value = 0U;
	uint32_t nonzero_count = 0U;
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if (!APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		return;
	}

	if ((label == NULL) || (buffer_ptr == NULL) || (buffer_len_bytes == 0U))
	{
		DebugConsole_Printf(
			"[AI] %s raw signature skipped: empty buffer.\r\n",
			(label != NULL) ? label : "(unnamed)");
		return;
	}

	preview_count = (buffer_len_bytes < sizeof(first_bytes)) ? buffer_len_bytes
															 : sizeof(first_bytes);

	for (size_t index = 0U; index < buffer_len_bytes; ++index)
	{
		const uint8_t value = buffer_ptr[index];

		hash ^= value;
		hash *= 16777619UL;

		if (value < min_value)
		{
			min_value = value;
		}
		if (value > max_value)
		{
			max_value = value;
		}
		if (value != 0U)
		{
			nonzero_count++;
		}
		if (index < preview_count)
		{
			first_bytes[index] = value;
		}
	}

	DebugConsole_Printf(
		"[AI] %s raw signature: bytes=%lu hash=0x%08lX nonzero=%lu min=%u max=%u first16=[%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
		label, (unsigned long)buffer_len_bytes, (unsigned long)hash,
		(unsigned long)nonzero_count, (unsigned int)min_value,
		(unsigned int)max_value, (unsigned int)first_bytes[0],
		(unsigned int)first_bytes[1], (unsigned int)first_bytes[2],
		(unsigned int)first_bytes[3], (unsigned int)first_bytes[4],
		(unsigned int)first_bytes[5], (unsigned int)first_bytes[6],
		(unsigned int)first_bytes[7], (unsigned int)first_bytes[8],
		(unsigned int)first_bytes[9], (unsigned int)first_bytes[10],
		(unsigned int)first_bytes[11], (unsigned int)first_bytes[12],
		(unsigned int)first_bytes[13], (unsigned int)first_bytes[14],
		(unsigned int)first_bytes[15]);
}

