rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	if (stage == NULL)
	{
		return false;
	}

	stage_label = (stage->stage_label != NULL) ? stage->stage_label : "scalar";
	is_rectifier = (strcmp(stage_label, "rectifier") == 0);
	is_obb = (strcmp(stage_label, "obb") == 0);
	bool is_source_crop_box = (strcmp(stage_label, "source_crop_box") == 0);

	if (is_rectifier)
	{
		DebugConsole_WriteString(
			"[AI] rectifier stage trusted on flash; skipping signature compare.\r\n");
		return true;
	}

	const uint8_t *sig_start;
	const uint8_t *sig_tail;
	bool sig_valid;
	ULONG programmed_size;

	if (is_obb)
	{
		sig_start = app_ai_obb_sig_valid
						? app_ai_obb_sig_start
						: app_ai_obb_xspi2_signature_start;
		sig_tail = app_ai_obb_sig_valid
					   ? app_ai_obb_sig_tail
					   : app_ai_obb_xspi2_signature_tail;
		sig_valid = app_ai_obb_sig_valid;
		programmed_size = app_ai_obb_programmed_size;
	}
	else if (is_source_crop_box)
	{
		sig_start = app_ai_source_crop_box_sig_valid
						? app_ai_source_crop_box_sig_start
						: app_ai_source_crop_box_xspi2_signature_start;
		sig_tail = app_ai_source_crop_box_sig_valid
					   ? app_ai_source_crop_box_sig_tail
					   : app_ai_source_crop_box_xspi2_signature_tail;
		sig_valid = app_ai_source_crop_box_sig_valid;
		programmed_size = app_ai_source_crop_box_programmed_size;
	}
	else
	{
		sig_start = app_ai_scalar_sig_valid
						? app_ai_scalar_sig_start
						: app_ai_xspi2_signature_start;
		sig_tail = app_ai_scalar_sig_valid
					   ? app_ai_scalar_sig_tail
					   : app_ai_xspi2_signature_tail;
		sig_valid = app_ai_scalar_sig_valid;
		programmed_size = app_ai_scalar_programmed_size;
	}

	if (!AppAI_Xspi2ReadStageProbe(stage, 0U,
								   sig_start, APP_AI_XSPI2_PROBE_BYTES))
	{
		/* Log the actual flash bytes so stale hardcoded signatures can be updated. */
		{
			uint8_t actual[APP_AI_XSPI2_PROBE_BYTES] = {0U};
			int32_t read_status = BSP_XSPI_NOR_Read(0U, actual,
													stage->xspi2_chip_offset, APP_AI_XSPI2_PROBE_BYTES);
#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
			char vlog[160];
			(void)DebugConsole_Snprintf(vlog, sizeof(vlog),
						   "[AI] %s mismatch rc=%ld bytes=[%02X%02X%02X%02X%02X%02X%02X%02X]\r\n",
						   stage->stage_label, (long)read_status,
						   actual[0], actual[1], actual[2], actual[3],
						   actual[4], actual[5], actual[6], actual[7]);
			DebugConsole_WriteString(vlog);
#else
			(void)read_status;
#endif
		}
		(void)DebugConsole_WriteString(
			"[AI] xSPI2 stage signature mismatch at head probe.\r\n");
		return false;
	}

	if (sig_valid && (programmed_size >= APP_AI_XSPI2_PROBE_BYTES) &&
		!AppAI_Xspi2ReadStageProbe(stage,
								   programmed_size - APP_AI_XSPI2_PROBE_BYTES,
								   sig_tail,
								   APP_AI_XSPI2_PROBE_BYTES))
	{
		{
#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
			char vlog[64];
			(void)DebugConsole_Snprintf(vlog, sizeof(vlog),
						   "[AI] %s flash verify: tail mismatch.\r\n",
						   stage->stage_label);
			(void)DebugConsole_WriteString(vlog);
#endif
		}
		(void)DebugConsole_WriteString(
			"[AI] xSPI2 stage signature mismatch at tail probe.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_ProgramXspi2ModelImageFromSd(void)
{
	FX_MEDIA *media_ptr = NULL;
	FX_FILE model_file = {0};
	ULONG file_size = 0U;
	ULONG bytes_read = 0U;
	ULONG bytes_remaining = 0U;
	ULONG flash_offset = 0U;
	UINT fx_status = FX_SUCCESS;
	UINT tx_status = TX_SUCCESS;
	int32_t bsp_status = BSP_ERROR_NONE;
	uint8_t source_prefix[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	uint8_t source_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	bool has_tail_probe = false;

	if (!AppAI_WaitForFileXMediaReady(APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS))
	{
		AppAI_LogXspi2LoadFailure("FileX not ready", FX_MEDIA_NOT_OPEN,
								  BSP_ERROR_NONE);
		return false;
	}

	tx_status = AppFileX_AcquireMediaLock();
	if (tx_status != TX_SUCCESS)
	{
		AppAI_LogXspi2LoadFailure("media lock", (UINT)tx_status, BSP_ERROR_NONE);
		return false;
	}

	media_ptr = AppFileX_GetMediaHandle();
	if (media_ptr == NULL)
	{
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("media handle", FX_MEDIA_NOT_OPEN,
								  BSP_ERROR_NONE);
		return false;
	}

	if (fx_directory_default_set(media_ptr, FX_NULL) != FX_SUCCESS)
	{
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("default directory", FX_SUCCESS,
								  BSP_ERROR_NONE);
		return false;
	}

	fx_status = fx_file_open(media_ptr, &model_file,
							 (CHAR *)APP_AI_XSPI2_MODEL_IMAGE_PATH, FX_OPEN_FOR_READ);
	if (fx_status != FX_SUCCESS)
	{
		(void)fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file open", fx_status, BSP_ERROR_NONE);
		return false;
	}

	file_size = model_file.fx_file_current_file_size;
	if (file_size == 0U)
	{
		(void)fx_file_close(&model_file);
		(void)fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file size (empty)", FX_SUCCESS, BSP_ERROR_NONE);
		return false;
	}
	DebugConsole_Printf("[AI] Model file size: %lu bytes.\r\n",
						(unsigned long)file_size);

	fx_status = fx_file_seek(&model_file, 0U);
	if (fx_status != FX_SUCCESS)
	{
		(void)fx_file_close(&model_file);
		(void)fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file seek", fx_status, BSP_ERROR_NONE);
		return false;
	}

	if (!AppAI_ReadXspi2ModelSourceProbes(&model_file, file_size,
										  source_prefix, source_tail, &has_tail_probe))
	{
		(void)fx_file_close(&model_file);
		(void)fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("source probes", FX_SUCCESS,
								  BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	for (ULONG erase_addr = 0U; erase_addr < file_size;
		 erase_addr += APP_AI_XSPI2_ERASE_BLOCK_BYTES)
	{
		if (erase_addr == 0U)
		{
			(void)DebugConsole_WriteString("[AI] xSPI2 stage erase begin.\r\n");
		}
		bsp_status = BSP_XSPI_NOR_Erase_Block(0U,
											  APP_AI_XSPI2_MODEL_CHIP_OFFSET + erase_addr,
											  BSP_XSPI_NOR_ERASE_64K);
		if (bsp_status != BSP_ERROR_NONE)
		{
			(void)fx_file_close(&model_file);
			(void)fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("flash erase", FX_SUCCESS, bsp_status);
			return false;
		}
	}

