rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	bytes_remaining = file_size;
	flash_offset = 0U;
	{
		ULONG chunk_index = 0U;

		while (bytes_remaining > 0U)
		{
			const ULONG chunk_size = (bytes_remaining > APP_AI_XSPI2_PROGRAM_CHUNK_BYTES)
										 ? APP_AI_XSPI2_PROGRAM_CHUNK_BYTES
										 : bytes_remaining;

			if ((flash_offset == 0U) || ((flash_offset % APP_AI_XSPI2_ERASE_BLOCK_BYTES) == 0U))
			{
				AppAI_LogXspi2ProgramChunkProgress(chunk_index, flash_offset,
												   chunk_size);
			}

			bytes_read = 0U;
			fx_status = fx_file_read(&model_file, app_ai_xspi2_program_buffer,
									 chunk_size, &bytes_read);
			if ((fx_status != FX_SUCCESS) || (bytes_read != chunk_size))
			{
				(void)fx_file_close(&model_file);
				(void)fx_directory_default_set(media_ptr, FX_NULL);
				AppFileX_ReleaseMediaLock();
				AppAI_LogXspi2LoadFailure("file read", fx_status, BSP_ERROR_NONE);
				return false;
			}

			/* Keep the flash writer honest: the staging buffer is cacheable RAM, so
			 * clean it before BSP_XSPI_NOR_Write() consumes the bytes. */
			(void)mcu_cache_clean_range((uint32_t)(uintptr_t)app_ai_xspi2_program_buffer,
										(uint32_t)(uintptr_t)app_ai_xspi2_program_buffer + (uint32_t)chunk_size);

			bsp_status = BSP_XSPI_NOR_Write(0U, app_ai_xspi2_program_buffer,
											APP_AI_XSPI2_MODEL_CHIP_OFFSET + flash_offset,
											(uint32_t)chunk_size);
			if (bsp_status != BSP_ERROR_NONE)
			{
				(void)fx_file_close(&model_file);
				(void)fx_directory_default_set(media_ptr, FX_NULL);
				AppFileX_ReleaseMediaLock();
				AppAI_LogXspi2LoadFailure("flash write", FX_SUCCESS, bsp_status);
				return false;
			}

			flash_offset += chunk_size;
			bytes_remaining -= chunk_size;
			chunk_index++;
		}
	}

	(void)fx_file_close(&model_file);
	(void)fx_directory_default_set(media_ptr, FX_NULL);
	AppFileX_ReleaseMediaLock();

	app_ai_xspi2_programmed_size = file_size;
	app_ai_scalar_programmed_size = file_size;
	(void)memcpy(app_ai_scalar_sig_start, source_prefix,
				 APP_AI_XSPI2_PROBE_BYTES);
	if (has_tail_probe)
	{
		(void)memcpy(app_ai_scalar_sig_tail, source_tail,
					 APP_AI_XSPI2_PROBE_BYTES);
	}
	else
	{
		(void)memset(app_ai_scalar_sig_tail, 0, APP_AI_XSPI2_PROBE_BYTES);
	}
	app_ai_scalar_sig_valid = has_tail_probe;
	AppAI_LogXspi2FlashStatus("legacy stage write complete");

	if (!AppAI_ReconfigureXspi2ForRuntime())
	{
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
								  BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	if (!AppAI_Xspi2EnableMemoryMappedMode())
	{
		AppAI_LogXspi2LoadFailure("enable MM after provision", FX_SUCCESS,
								  BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogXspi2IndirectAndMappedPrefix();
		AppAI_LogXspi2MappedScaleBytes();
	}

	return true;
}

static void AppAI_SetForcedCrop(const char *label, size_t x_min,
								size_t y_min, size_t width, size_t height)
{
	app_ai_forced_crop_active = true;
	app_ai_forced_crop_label = label;
	app_ai_forced_crop_x_min = x_min;
	app_ai_forced_crop_y_min = y_min;
	app_ai_forced_crop_width = width;
	app_ai_forced_crop_height = height;
}

static void AppAI_ClearForcedCrop(void)
{
	app_ai_forced_crop_active = false;
	app_ai_forced_crop_label = NULL;
	app_ai_forced_crop_x_min = 0U;
	app_ai_forced_crop_y_min = 0U;
	app_ai_forced_crop_width = 0U;
	app_ai_forced_crop_height = 0U;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetStageInputBufferInfo(
	const AppAI_ModelStageSpec *stage)
{
	const LL_Buffer_InfoTypeDef *input_info = NULL;

	if ((stage == NULL) || (stage->nn_instance == NULL) || (stage->nn_instance->network == NULL) || (stage->nn_instance->network->input_buffers_info == NULL))
	{
		return NULL;
	}

	input_info = stage->nn_instance->network->input_buffers_info();
	if ((input_info == NULL) || (input_info->name == NULL))
	{
		return NULL;
	}
	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetStageOutputBufferInfo(
	const AppAI_ModelStageSpec *stage)
{
	const LL_Buffer_InfoTypeDef *output_info = NULL;

	if ((stage == NULL) || (stage->nn_instance == NULL) || (stage->nn_instance->network == NULL) || (stage->nn_instance->network->output_buffers_info == NULL))
	{
		return NULL;
	}

	output_info = stage->nn_instance->network->output_buffers_info();
	if ((output_info == NULL) || (output_info->name == NULL))
	{
		return NULL;
	}
	return output_info;
}

static bool AppAI_ReadXspi2ModelSourceProbes(FX_FILE *model_file_ptr,
											 ULONG file_size, uint8_t *source_prefix, uint8_t *source_tail,
											 bool *has_tail_out)
{
	ULONG bytes_read = 0U;
	UINT fx_status = FX_SUCCESS;

	if ((model_file_ptr == NULL) || (source_prefix == NULL) || (source_tail == NULL) || (has_tail_out == NULL))
	{
		return false;
	}

	*has_tail_out = false;

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS)
	{
		return false;
	}

	bytes_read = 0U;
	fx_status = fx_file_read(model_file_ptr, source_prefix,
							 APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS) || (bytes_read != APP_AI_XSPI2_PROBE_BYTES))
	{
		return false;
	}
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_prefix);
	}

	if (file_size >= APP_AI_XSPI2_PROBE_BYTES)
	{
		fx_status = fx_file_seek(model_file_ptr,
								 file_size - APP_AI_XSPI2_PROBE_BYTES);
		if (fx_status != FX_SUCCESS)
		{
			return false;
		}

		bytes_read = 0U;
		fx_status = fx_file_read(model_file_ptr, source_tail,
								 APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
		if ((fx_status != FX_SUCCESS) || (bytes_read != APP_AI_XSPI2_PROBE_BYTES))
		{
			return false;
		}
		if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
		{
			AppAI_LogXspi2PrefixBytes("xSPI2 source tail:", source_tail);
		}
		*has_tail_out = true;
	}

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS)
	{
		return false;
	}

