rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	(void) fx_file_close(&model_file);
	(void) fx_directory_default_set(media_ptr, FX_NULL);
	AppFileX_ReleaseMediaLock();

	app_ai_xspi2_programmed_size = file_size;
	/* Update the per-stage size so the verify tail-probe uses the right offset
	 * regardless of which stage was provisioned last. */
	if (strcmp(stage->stage_label, "rectifier") == 0) {
		app_ai_rectifier_programmed_size = file_size;
		(void) memcpy(app_ai_rectifier_sig_start, source_prefix,
				APP_AI_XSPI2_PROBE_BYTES);
		(void) memcpy(app_ai_rectifier_sig_tail, source_tail,
				APP_AI_XSPI2_PROBE_BYTES);
		app_ai_rectifier_sig_valid = has_tail_probe;
	} else {
		app_ai_scalar_programmed_size = file_size;
		(void) memcpy(app_ai_scalar_sig_start, source_prefix,
				APP_AI_XSPI2_PROBE_BYTES);
		(void) memcpy(app_ai_scalar_sig_tail, source_tail,
				APP_AI_XSPI2_PROBE_BYTES);
		app_ai_scalar_sig_valid = has_tail_probe;
	}

	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	if (!AppAI_Xspi2EnableMemoryMappedMode()) {
		AppAI_LogXspi2LoadFailure("enable MM after provision", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	(void) DebugConsole_WriteString(
			"[AI] xSPI2 stage provisioning complete; verify skipped.\r\n");
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS) {
		AppAI_LogXspi2IndirectAndMappedPrefix();
		AppAI_LogXspi2MappedScaleBytes();
	}
	app_ai_loaded_xspi2_stage = stage;
	DebugConsole_Printf("[AI] %s xSPI2 model image ready.\r\n",
			stage->stage_label);
	return true;
}
#endif /* 0 */

static bool AppAI_EnsureXspi2ModelImageReadyForStage(
	const AppAI_ModelStageSpec *stage)
{
	if (stage == NULL)
	{
		return false;
	}

	/* Fast path: pointer equality means this stage is already in its flash
	 * region and the peripheral is already in mapped mode for it. */
	if (app_ai_loaded_xspi2_stage == stage)
	{
		(void)DebugConsole_WriteString("[AI] xSPI2 stage already loaded.\r\n");
		if (!app_ai_xspi2_mm_enabled)
		{
			(void)DebugConsole_WriteString(
				"[AI] xSPI2 stage was loaded but MM was off; re-enabling MM.\r\n");
			if (!AppAI_Xspi2EnableMemoryMappedMode())
			{
				return false;
			}
		}
		return true;
	}

	/* Each stage now has its own flash region, so we can verify whether the
	 * stage's bytes are already present without disturbing the other stage.
	 * Switch to indirect mode first (needed for BSP_XSPI_NOR_Read). */
	DebugConsole_WriteString("[AI] xSPI2 stage reconfigure start.\r\n");
	if (!AppAI_ReconfigureXspi2ForRuntime())
	{
		DebugConsole_WriteString("[AI] xSPI2 stage reconfigure FAILED.\r\n");
		return false;
	}
	/* Any reconfigure invalidates the previously loaded stage/MM state until
	 * this function verifies and re-enables mapped mode for the target stage. */
	app_ai_loaded_xspi2_stage = NULL;
	DebugConsole_WriteString("[AI] xSPI2 stage reconfigure OK.\r\n");

	if (!AppAI_Xspi2ModelImageMatchesMappedFlashForStage(stage))
	{
		/* The scalar stage can recover by provisioning from SD when the flashed
		 * blob does not match the compiled metadata. */
		if (stage == &app_ai_scalar_stage)
		{
			DebugConsole_WriteString(
				"[AI] xSPI2 scalar signature mismatch detected.\r\n");
#if APP_AI_ENABLE_SCALAR_SD_REPROVISION
			DebugConsole_WriteString(
				"[AI] xSPI2 scalar signature mismatch; attempting SD reprovision.\r\n");
			/* Do not block the AI worker for minutes waiting on FileX. If media
			 * is not ready yet, fail fast and let the next inference cycle retry. */
			if (!AppFileX_IsMediaReady())
			{
				DebugConsole_WriteString(
					"[AI] xSPI2 scalar reprovision skipped: FileX media not ready.\r\n");
				return false;
			}
			if (!AppAI_ProgramXspi2ModelImageFromSd())
			{
				DebugConsole_WriteString(
					"[AI] xSPI2 scalar SD reprovision failed.\r\n");
				return false;
			}
			app_ai_loaded_xspi2_stage = NULL;
			if (!AppAI_Xspi2ModelImageMatchesMappedFlashForStage(stage))
			{
				DebugConsole_WriteString(
					"[AI] xSPI2 scalar signature mismatch persists after reprovision.\r\n");
				return false;
			}
#else
			DebugConsole_WriteString(
				"[AI] scalar SD reprovision disabled; reflash scalar blob via flash script.\r\n");
			return false;
#endif
		}
		else
		{
			/* Non-scalar stages still fail fast on signature mismatch. */
			DebugConsole_Printf(
				"[AI] xSPI2 stage '%s' signature mismatch; aborting stage load.\r\n",
				stage->stage_label);
			return false;
		}
	}

	DebugConsole_WriteString("[AI] xSPI2 stage image already present.\r\n");

	/* Reprovision can already leave xSPI2 in memory-mapped mode for this
	 * stage. Avoid a second enable call in that case, which has been
	 * intermittently failing on board. */
	if (!app_ai_xspi2_mm_enabled && !AppAI_Xspi2EnableMemoryMappedMode())
	{
		AppAI_LogXspi2LoadFailure("enable MM after verify", FX_SUCCESS,
								  BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	app_ai_loaded_xspi2_stage = stage;
	return true;
}

static bool AppAI_EnsureStageRuntimeReady(const AppAI_ModelStageSpec *stage)
{
	if (stage == NULL)
	{
		return false;
	}

	DebugConsole_WriteString("[AI] Stage runtime ready start.\r\n");
	DebugConsole_Printf("[AI] Stage label: %s\r\n",
						(stage->stage_label != NULL) ? stage->stage_label : "(unnamed)");
	if (!AppAI_EnsureXspi2ModelImageReadyForStage(stage))
	{
		DebugConsole_WriteString(
			"[AI] Stage runtime ready failed during xSPI2 setup.\r\n");
		return false;
	}

	DebugConsole_WriteString("[AI] Stage network init start.\r\n");
	if ((stage->network_init_fn == NULL) || !stage->network_init_fn())
	{
		AppAI_LogInitFailure(stage->stage_label);
		return false;
	}

	LL_ATON_RT_Init_Network(stage->nn_instance);
	DebugConsole_WriteString("[AI] Stage network init OK.\r\n");

	DebugConsole_WriteString("[AI] Stage inference init start.\r\n");
	if ((stage->inference_init_fn == NULL) || !stage->inference_init_fn())
	{
		AppAI_LogInitFailure(stage->stage_label);
		return false;
	}

	DebugConsole_WriteString("[AI] Stage inference init OK.\r\n");
	return true;
}

