rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static bool AppAI_DecodeRectifierCropBox(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	AppAI_SourceCrop *crop_out,
	AppAI_RectifierBox *rectifier_box_out)
{
	const float *output_ptr = NULL;
	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	float center_x = 0.0f;
	float center_y = 0.0f;
	float box_w = 0.0f;
	float box_h = 0.0f;
	float crop_x_min_f = 0.0f;
	float crop_y_min_f = 0.0f;
	float crop_width_f = 0.0f;
	float crop_height_f = 0.0f;
#if APP_AI_RECTIFIER_FIXED_SCALE_CROP
	size_t training_center_x = 0U;
	size_t training_center_y = 0U;
	const float rectifier_center_blend_f =
		((float)APP_AI_RECTIFIER_CENTER_BLEND_NUMERATOR) / ((float)APP_AI_RECTIFIER_CENTER_BLEND_DENOMINATOR);
#endif
	bool use_fixed_training_crop = false;

	if ((output_buffer_info == NULL) || (crop_out == NULL))
	{
		return false;
	}

	output_ptr = (const float *)LL_Buffer_addr_start(output_buffer_info);
	if ((output_ptr == NULL) || (LL_Buffer_len(output_buffer_info) < (sizeof(float) * 4U)))
	{
		return false;
	}

	/* Log the raw rectifier output before any clamping so we can distinguish
	 * between the model producing a plausible box that the fallback rejects,
	 * a near-zero output (model not running / zero-init), or an out-of-range
	 * value (wrong output format / normalization mismatch). */
	{
		union
		{
			float f;
			uint32_t u;
		} r0, r1, r2, r3;
		char rect_log[192];
		r0.f = output_ptr[0];
		r1.f = output_ptr[1];
		r2.f = output_ptr[2];
		r3.f = output_ptr[3];
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
		(void)DebugConsole_Snprintf(rect_log, sizeof(rect_log),
					   "[AI] Rectifier raw: cx=%ld cy=%ld w=%ld h=%ld "
					   "bits=[%08lX %08lX %08lX %08lX]\r\n",
					   (long)(output_ptr[0] * 1000.0f),
					   (long)(output_ptr[1] * 1000.0f),
					   (long)(output_ptr[2] * 1000.0f),
					   (long)(output_ptr[3] * 1000.0f),
					   (unsigned long)r0.u, (unsigned long)r1.u,
					   (unsigned long)r2.u, (unsigned long)r3.u);
		(void)DebugConsole_WriteString(rect_log);
#endif
	}

	center_x = AppAI_ClampNormalizedFloat(output_ptr[0]);
	center_y = AppAI_ClampNormalizedFloat(output_ptr[1]);
	box_w = AppAI_ClampNormalizedFloat(output_ptr[2]);
	box_h = AppAI_ClampNormalizedFloat(output_ptr[3]);
	if (box_w < APP_AI_RECTIFIER_MIN_BOX_RATIO)
	{
		box_w = APP_AI_RECTIFIER_MIN_BOX_RATIO;
	}
	if (box_h < APP_AI_RECTIFIER_MIN_BOX_RATIO)
	{
		box_h = APP_AI_RECTIFIER_MIN_BOX_RATIO;
	}

	if (rectifier_box_out != NULL)
	{
		rectifier_box_out->center_x = center_x;
		rectifier_box_out->center_y = center_y;
		rectifier_box_out->box_w = box_w;
		rectifier_box_out->box_h = box_h;
	}

#if APP_AI_RECTIFIER_FIXED_SCALE_CROP
	/* Soft attention: ignore (box_w, box_h) entirely. Validate centre only. */
	if ((center_x < APP_AI_RECTIFIER_CENTER_MIN_RATIO) || (center_x > APP_AI_RECTIFIER_CENTER_MAX_RATIO) || (center_y < APP_AI_RECTIFIER_CENTER_MIN_RATIO) || (center_y > APP_AI_RECTIFIER_CENTER_MAX_RATIO))
	{
		{
			char fb_log[96];
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
			(void)DebugConsole_Snprintf(fb_log, sizeof(fb_log),
						   "[AI] Rect fallback (centre out of range): cx=%ld cy=%ld lim=[%ld..%ld]\r\n",
						   (long)(center_x * 1000.0f), (long)(center_y * 1000.0f),
						   (long)(APP_AI_RECTIFIER_CENTER_MIN_RATIO * 1000.0f),
						   (long)(APP_AI_RECTIFIER_CENTER_MAX_RATIO * 1000.0f));
			(void)DebugConsole_WriteString(fb_log);
#endif
		}
		use_fixed_training_crop = true;
	}
#else
	if ((box_w < APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO) || (box_h < APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO) || (box_w > APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO) || (box_h > APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO))
	{
		{
			char fb_log[96];
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
			(void)DebugConsole_Snprintf(fb_log, sizeof(fb_log),
						   "[AI] Rect fallback: cx=%ld cy=%ld w=%ld h=%ld lim=[%ld..%ld]\r\n",
						   (long)(center_x * 1000.0f), (long)(center_y * 1000.0f),
						   (long)(box_w * 1000.0f), (long)(box_h * 1000.0f),
						   (long)(APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO * 1000.0f),
						   (long)(APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO * 1000.0f));
			(void)DebugConsole_WriteString(fb_log);
#endif
		}
		use_fixed_training_crop = true;
	}
#endif

	if (use_fixed_training_crop)
	{
		/* Keep the scalar reader on the same stable crop that the offline
		 * training/evaluation path uses when the rectifier output is implausible.
		 * That avoids 1x1/tiny crops and avoids treating full-frame predictions
		 * as if they were useful dial boxes. */
		crop_out->x_min = (size_t)((float)source_width * APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_out->y_min = (size_t)((float)source_height * APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_out->width = (size_t)((float)source_width * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_out->height = (size_t)((float)source_height * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_out->width == 0U)
		{
			crop_out->width = 1U;
		}
		if (crop_out->height == 0U)
		{
			crop_out->height = 1U;
		}
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
		{
			char fb_log[128];

			(void)DebugConsole_Snprintf(fb_log, sizeof(fb_log),
						   "[AI] Rectifier fallback -> fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
						   (unsigned long)crop_out->x_min,
						   (unsigned long)crop_out->y_min,
						   (unsigned long)crop_out->width,
						   (unsigned long)crop_out->height);
			(void)DebugConsole_WriteString(fb_log);
		}
#else
		DebugConsole_WriteString(
			"[AI] Rectifier crop fallback: using fixed training crop.\r\n");
#endif
		return true;
	}

#if APP_AI_RECTIFIER_FIXED_SCALE_CROP
	/* Soft attention: rectifier provides a nudge, training crop provides the
	 * base framing. This keeps the scalar input close to the fixed crop that it
	 * was trained on while still letting the crop track the gauge a little. */
	AppGaugeGeometry_TrainingCropCenter(source_width, source_height,
										&training_center_x, &training_center_y);
	crop_width_f = ((float)source_width) * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO);
	crop_height_f = ((float)source_height) * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO);
#else
	crop_width_f = ((float)source_width) * box_w * APP_AI_RECTIFIER_CROP_SCALE;
	crop_height_f = ((float)source_height) * box_h * APP_AI_RECTIFIER_CROP_SCALE;
#endif
	if (crop_width_f < 1.0f)
	{
		crop_width_f = 1.0f;
	}
	if (crop_height_f < 1.0f)
	{
		crop_height_f = 1.0f;
	}

