rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
#if APP_AI_RECTIFIER_FIXED_SCALE_CROP
	crop_x_min_f = ((float)training_center_x) + ((((float)source_width) * center_x - (float)training_center_x) * rectifier_center_blend_f) - (crop_width_f * 0.5f);
	crop_y_min_f = ((float)training_center_y) + ((((float)source_height) * center_y - (float)training_center_y) * rectifier_center_blend_f) - (crop_height_f * 0.5f);
#else
	crop_x_min_f = (((float)source_width) * center_x) - (crop_width_f * 0.5f);
	crop_y_min_f = (((float)source_height) * center_y) - (crop_height_f * 0.5f);
#endif
	if (crop_x_min_f < 0.0f)
	{
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f)
	{
		crop_y_min_f = 0.0f;
	}
	if ((crop_x_min_f + crop_width_f) > (float)source_width)
	{
		crop_x_min_f = (float)source_width - crop_width_f;
	}
	if ((crop_y_min_f + crop_height_f) > (float)source_height)
	{
		crop_y_min_f = (float)source_height - crop_height_f;
	}
	if (crop_x_min_f < 0.0f)
	{
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f)
	{
		crop_y_min_f = 0.0f;
	}

	crop_out->x_min = (size_t)(crop_x_min_f + 0.5f);
	crop_out->y_min = (size_t)(crop_y_min_f + 0.5f);
	crop_out->width = (size_t)(crop_width_f + 0.5f);
	crop_out->height = (size_t)(crop_height_f + 0.5f);

	if (crop_out->width == 0U)
	{
		crop_out->width = 1U;
	}
	if (crop_out->height == 0U)
	{
		crop_out->height = 1U;
	}
	if (crop_out->x_min >= source_width)
	{
		crop_out->x_min = source_width - 1U;
	}
	if (crop_out->y_min >= source_height)
	{
		crop_out->y_min = source_height - 1U;
	}
	if ((crop_out->x_min + crop_out->width) > source_width)
	{
		crop_out->width = source_width - crop_out->x_min;
	}
	if ((crop_out->y_min + crop_out->height) > source_height)
	{
		crop_out->height = source_height - crop_out->y_min;
	}

	return true;
}

#if !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogXspi2PrefixBytes(const char *label,
									  const uint8_t *bytes)
{
	(void)label;
	(void)bytes;
}

static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
									size_t frame_size)
{
	(void)frame_bytes;
	(void)frame_size;
}

static void AppAI_LogInputSignature(const float *input_buffer,
									size_t input_float_count)
{
	(void)input_buffer;
	(void)input_float_count;
}

static void AppAI_LogInputTensorWindow(const float *input_buffer,
									   size_t input_float_count)
{
	(void)input_buffer;
	(void)input_float_count;
}

static void AppAI_LogInputProbeSummary(const float *input_buffer,
									   size_t input_float_count)
{
	(void)input_buffer;
	(void)input_float_count;
}

static void AppAI_LogTensorRowSamples(const char *label,
									  const float *input_buffer, size_t tensor_width, size_t y,
									  size_t x_min, size_t x_max)
{
	(void)label;
	(void)input_buffer;
	(void)tensor_width;
	(void)y;
	(void)x_min;
	(void)x_max;
}

static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
								 size_t frame_width_pixels, size_t center_x, size_t center_y,
								 size_t radius_pixels)
{
	(void)label;
	(void)frame_bytes;
	(void)frame_width_pixels;
	(void)center_x;
	(void)center_y;
	(void)radius_pixels;
}

static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
								 size_t tensor_width, size_t center_x, size_t center_y,
								 size_t radius_pixels)
{
	(void)label;
	(void)input_buffer;
	(void)tensor_width;
	(void)center_x;
	(void)center_y;
	(void)radius_pixels;
}

static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
									  size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
									  size_t crop_x_min, size_t crop_y_min, size_t crop_width,
									  size_t crop_height)
{
	(void)frame_bytes;
	(void)frame_size;
	(void)frame_width_pixels;
	(void)frame_height_pixels;
	(void)crop_x_min;
	(void)crop_y_min;
	(void)crop_width;
	(void)crop_height;
}

static void AppAI_LogInt8BufferSignature(const char *label,
										 const int8_t *buffer_ptr, size_t buffer_len_bytes)
{
	(void)label;
	(void)buffer_ptr;
	(void)buffer_len_bytes;
}

static void AppAI_LogRawBufferSignature(const char *label,
										const uint8_t *buffer_ptr, size_t buffer_len_bytes)
{
	(void)label;
	(void)buffer_ptr;
	(void)buffer_len_bytes;
}

static const char *AppAI_BufferTypeName(const LL_Buffer_InfoTypeDef *buffer_info)
{
	(void)buffer_info;
	return "OTHER";
}

static void AppAI_LogBufferInfoAndSignature(const char *label,
											const LL_Buffer_InfoTypeDef *buffer_info)
{
	(void)label;
	(void)buffer_info;
}
#endif /* !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

static void AppAI_LogRectifierResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	const AppAI_RectifierBox *rectifier_box)
{
	if ((output_buffer_info == NULL) || (rectifier_box == NULL))
	{
		DebugConsole_Printf("[AI] Rectifier output missing.\r\n");
		return;
	}

	DebugConsole_Printf("[AI] Rectifier output: name=%s addr=%p len=%lu\r\n",
						(output_buffer_info->name != NULL) ? output_buffer_info->name
														   : "(unnamed)",
						LL_Buffer_addr_start(output_buffer_info),
						(unsigned long)LL_Buffer_len(output_buffer_info));
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
	DebugConsole_Printf(
		"[AI] Rectifier box(clamped): cx=%.6f cy=%.6f w=%.6f h=%.6f\r\n",
		rectifier_box->center_x, rectifier_box->center_y,
		rectifier_box->box_w, rectifier_box->box_h);
#endif
}

static void AppAI_LogObbResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	const AppAI_ObbBox *obb_box)
{
	float theta_deg = 0.0f;

	if ((output_buffer_info == NULL) || (obb_box == NULL))
	{
		DebugConsole_Printf("[AI] OBB output missing.\r\n");
		return;
	}

	theta_deg = obb_box->theta_rad * 57.29577951308232f;
	DebugConsole_Printf("[AI] OBB output: name=%s addr=%p len=%lu\r\n",
						(output_buffer_info->name != NULL) ? output_buffer_info->name
														   : "(unnamed)",
						LL_Buffer_addr_start(output_buffer_info),
						(unsigned long)LL_Buffer_len(output_buffer_info));
#if APP_AI_ENABLE_RECTIFIER_DIAGNOSTICS
	DebugConsole_Printf(
		"[AI] OBB box(clamped): cx=%.6f cy=%.6f w=%.6f h=%.6f cos=%.6f sin=%.6f theta=%.2fdeg\r\n",
		obb_box->center_x, obb_box->center_y, obb_box->box_w,
		obb_box->box_h, obb_box->angle_cos, obb_box->angle_sin,
		theta_deg);
#endif
}

static bool AppAI_DecodeObbCropBox(
	const LL_Buffer_InfoTypeDef *output_buffer_info,
	AppAI_SourceCrop *crop_out,
	AppAI_ObbBox *obb_box_out)
{
	const float *output_ptr = NULL;
	const float source_width_f = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const float source_height_f = (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const float input_size_f = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t training_crop_width = (size_t)(((float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO)) + 0.5f);
	const size_t training_crop_height = (size_t)(((float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO)) + 0.5f);
	size_t training_center_x = 0U;
	size_t training_center_y = 0U;
	float center_x = 0.0f;
	float center_y = 0.0f;
	float box_w = 0.0f;
	float box_h = 0.0f;
	float angle_cos = 0.0f;
	float angle_sin = 0.0f;
	float theta_rad = 0.0f;
	float canvas_center_x = 0.0f;
	float canvas_center_y = 0.0f;
	float half_width = 0.0f;
	float half_height = 0.0f;
	float crop_x_min_f = 0.0f;
	float crop_y_min_f = 0.0f;
	float crop_x_max_f = 0.0f;
	float crop_y_max_f = 0.0f;

	if ((output_buffer_info == NULL) || (crop_out == NULL))
	{
		return false;
	}

