rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	max_logit = top_logits[0];
	for (i = 1U; i < topk; ++i)
	{
		if (top_logits[i] > max_logit)
		{
			max_logit = top_logits[i];
		}
	}

	for (i = 0U; i < topk; ++i)
	{
		const float scaled =
			(top_logits[i] - max_logit) / APP_AI_SCALAR_DECODE_TEMPERATURE;
		const float weight = expf(scaled);
		const float bin_position =
			(float)top_indices[i] / (float)(element_count - 1U);

		weight_sum += weight;
		weighted_fraction_sum += weight * bin_position;
	}

	if ((weight_sum <= 0.0f) || !AppAI_IsFiniteFloat(weight_sum))
	{
		return false;
	}

	fraction = weighted_fraction_sum / weight_sum;
	if (fraction < 0.0f)
	{
		fraction = 0.0f;
	}
	else if (fraction > 1.0f)
	{
		fraction = 1.0f;
	}

	decoded_value = APP_AI_SCALAR_DECODE_VALUE_MIN_C +
					fraction * (APP_AI_SCALAR_DECODE_VALUE_MAX_C - APP_AI_SCALAR_DECODE_VALUE_MIN_C);
	if (!AppAI_IsFiniteFloat(decoded_value))
	{
		return false;
	}

	*decoded_value_out = decoded_value;
	return true;
}
#endif /* !APP_AI_DISABLE_LEGACY_TOPK_DECODE */

/* Decode V28 polar-vote circular output: 224 int8 logits -> gauge temperature.
 *
 * Steps:
 *   1. Dequantize int8 logits to float using output scale/zero_point.
 *   2. Build angle array: angles[i] = 2*pi*i / 224.
 *   3. Compute shifted_angle[i] = fmod(angle[i] - min_angle_rad, 2*pi).
 *   4. Mask: if shifted_angle > sweep_rad + eps, set logit to -1e9.
 *   5. Softmax over 224 masked logits.
 *   6. Circular mean: sin_sum = sum(probs * sin(angles)), cos_sum = sum(probs * cos(angles)).
 *   7. mean_angle = fmod(atan2(sin_sum, cos_sum), 2*pi).
 *   8. fraction = clamp(fmod(mean_angle - min_angle_rad, 2*pi) / sweep_rad, 0, 1).
 *   9. temperature = min_value + fraction * (max_value - min_value).
 */
static bool AppAI_DecodeCircularVoteFromOutput(
	const uint8_t *output_ptr,
	size_t output_len_bytes,
	float *decoded_value_out)
{
	/* Bins must match the model output dimension. */
	const size_t bins = (size_t)APP_AI_POLAR_VOTE_BINS;
	const float min_angle_rad = APP_AI_POLAR_VOTE_MIN_ANGLE_RAD;
	const float sweep_rad = APP_AI_POLAR_VOTE_SWEEP_RAD;
	const float min_value_c = APP_AI_POLAR_VOTE_MIN_VALUE_C;
	const float max_value_c = APP_AI_POLAR_VOTE_MAX_VALUE_C;
	const float mask_logit = APP_AI_POLAR_MASK_LOGIT;
	const float scale = APP_AI_POLAR_OUTPUT_SCALE;
	const int zero_point = APP_AI_POLAR_OUTPUT_ZERO_POINT;
	const float two_pi = 2.0f * 3.14159265358979323846f;
	float logits[224U];
	float probs[224U];
	float angles[224U];
	float sin_sum = 0.0f;
	float cos_sum = 0.0f;
	float max_logit = -1.0e30f;
	float sum_exp = 0.0f;
	float mean_angle = 0.0f;
	float fraction = 0.0f;
	float temperature = 0.0f;
	size_t i = 0U;

	if ((output_ptr == NULL) || (decoded_value_out == NULL))
	{
		return false;
	}

	/* We expect exactly 224 int8 output elements. */
	if (output_len_bytes < bins)
	{
		return false;
	}

	/* Step 1: dequantize int8 logits and build angle array. */
	for (i = 0U; i < bins; ++i)
	{
		/* Dequantize: float_val = (q - zero_point) * scale. */
		const int32_t q_val = (int32_t)(*(const int8_t *)&output_ptr[i]);
		const float logit_val = ((float)(q_val - zero_point)) * scale;
		const float angle = (two_pi * (float)i) / (float)bins;
		const float shifted = angle - min_angle_rad;
		float shifted_angle = shifted;
		/* fmod-equivalent: wrap shifted_angle into [0, 2*pi). */
		if (shifted_angle < 0.0f)
		{
			shifted_angle += two_pi;
		}
		if (shifted_angle >= two_pi)
		{
			shifted_angle -= two_pi;
		}
		/* Step 2-3: mask bins outside the gauge sweep. */
		if (shifted_angle > (sweep_rad + 1.0e-6f))
		{
			logits[i] = mask_logit;
		}
		else
		{
			logits[i] = logit_val;
		}
		angles[i] = angle;
	}

	/* Step 4: softmax. Find max for numerical stability. */
	for (i = 0U; i < bins; ++i)
	{
		if (logits[i] > max_logit)
		{
			max_logit = logits[i];
		}
	}

	/* Compute exp(logit - max) and accumulate. */
	for (i = 0U; i < bins; ++i)
	{
		probs[i] = expf(logits[i] - max_logit);
		sum_exp += probs[i];
	}

	/* Normalize and compute circular mean. */
	if ((sum_exp <= 0.0f) || !AppAI_IsFiniteFloat(sum_exp))
	{
		return false;
	}

	for (i = 0U; i < bins; ++i)
	{
		probs[i] /= sum_exp;
		sin_sum += probs[i] * sinf(angles[i]);
		cos_sum += probs[i] * cosf(angles[i]);
	}

	/* Step 5: circular mean angle. */
	mean_angle = atan2f(sin_sum, cos_sum);
	if (mean_angle < 0.0f)
	{
		mean_angle += two_pi;
	}

	/* Step 6: convert mean angle to gauge fraction and temperature. */
	fraction = (mean_angle - min_angle_rad) / sweep_rad;
	if (fraction < 0.0f)
	{
		fraction += (two_pi / sweep_rad);
	}
	/* Clamp fraction to [0, 1]. */
	if (fraction < 0.0f)
	{
		fraction = 0.0f;
	}
	if (fraction > 1.0f)
	{
		fraction = 1.0f;
	}

	temperature = min_value_c + fraction * (max_value_c - min_value_c);

	if (!AppAI_IsFiniteFloat(temperature))
	{
		return false;
	}

	*decoded_value_out = temperature;
	return true;
}

static bool AppAI_RunStageInference(const AppAI_ModelStageSpec *stage,
									const uint8_t *frame_bytes, size_t frame_size,
									const AppAI_SourceCrop *forced_crop,
									const LL_Buffer_InfoTypeDef **output_info_out,
									float *output_value_out)
{
	const LL_Buffer_InfoTypeDef *input_info = NULL;
	const LL_Buffer_InfoTypeDef *output_info = NULL;
	uint8_t *input_bytes_ptr = NULL;
	float *input_ptr = NULL;
	size_t input_len_bytes = 0U;
	size_t input_float_count = 0U;
	const uint8_t *output_ptr = NULL;
	size_t output_len_bytes = 0U;
	float output_value = 0.0f;

	if ((stage == NULL) || (frame_bytes == NULL))
	{
		return false;
	}

	(void)DebugConsole_WriteString("[AI] Stage inference request.\r\n");
	if (!AppAI_EnsureStageRuntimeReady(stage))
	{
		(void)DebugConsole_WriteString(
			"[AI] Stage inference aborted before preprocess.\r\n");
		return false;
	}

	input_info = AppAI_GetStageInputBufferInfo(stage);
	output_info = AppAI_GetStageOutputBufferInfo(stage);
	if ((input_info == NULL) || (output_info == NULL))
	{
		AppAI_ClearForcedCrop();
		return false;
	}

	input_bytes_ptr = (uint8_t *)LL_Buffer_addr_start(input_info);
	input_ptr = (float *)input_bytes_ptr;
	input_len_bytes = (size_t)LL_Buffer_len(input_info);
	input_float_count = input_len_bytes / sizeof(float);
	if (input_bytes_ptr == NULL)
	{
		AppAI_ClearForcedCrop();
		return false;
	}
	if (stage == &app_ai_scalar_stage)
	{
		DebugConsole_Printf(
			"[AI] Scalar input contract: name=%s addr=%p len=%lu nbits=%lu qu=%lu Qm=%lu Qn=%lu\r\n",
			(input_info->name != NULL) ? input_info->name : "(unnamed)",
			(void *)input_bytes_ptr, (unsigned long)input_len_bytes,
			(unsigned long)input_info->nbits,
			(unsigned long)input_info->Qunsigned,
			(unsigned long)input_info->Qm,
			(unsigned long)input_info->Qn);
	}

	if (forced_crop != NULL)
	{
		AppAI_SetForcedCrop(stage->stage_label, forced_crop->x_min,
							forced_crop->y_min, forced_crop->width, forced_crop->height);
	}
	else
	{
		AppAI_ClearForcedCrop();
	}

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		DebugConsole_Printf(
			"[AI] Run stage=%s frame_ptr=%p frame_size=%lu input=%s addr=%p len=%lu output=%s addr=%p len=%lu\r\n",
			stage->stage_label, (const void *)frame_bytes,
			(unsigned long)frame_size,
			(input_info->name != NULL) ? input_info->name : "(unnamed)",
			(void *)input_ptr, (unsigned long)input_len_bytes,
			(output_info->name != NULL) ? output_info->name : "(unnamed)",
			(void *)LL_Buffer_addr_start(output_info),
			(unsigned long)LL_Buffer_len(output_info));
	}

#if APP_AI_YUV422_INPUT_LUMA_ONLY
	if (!AppAI_PreprocessYuv422FrameToFloatInput(frame_bytes, frame_size,
												 input_ptr, input_float_count,
												 input_len_bytes))
	{
		AppAI_ClearForcedCrop();
		return false;
	}
#else
	if ((stage == &app_ai_scalar_stage) && (input_info->nbits <= 8U))
	{
		/* V28 polar-vote model: 7-channel int8 polar input. */
		if (!AppAI_PreprocessYuv422FrameToPolarInput(frame_bytes, frame_size,
														  input_bytes_ptr, input_len_bytes,
														  input_info))
		{
			AppAI_ClearForcedCrop();
			return false;
		}
	}
	else if (input_info->nbits <= 8U)
	{
		/* Non-scalar int8 stages (rectifier, OBB): legacy 3-channel path. */
		if (!AppAI_PreprocessYuv422FrameToInt8Input(frame_bytes, frame_size,
													input_bytes_ptr, input_len_bytes,
													input_info))
		{
			AppAI_ClearForcedCrop();
			return false;
		}
	}
	else if (!AppAI_PreprocessYuv422FrameToFloatInput(frame_bytes, frame_size,
													  input_ptr, input_float_count,
													  input_len_bytes))
	{
		AppAI_ClearForcedCrop();
		return false;
	}
#endif

	(void)DebugConsole_WriteString("[AI] Stage preprocess OK.\r\n");

