rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static void AppAI_LogXspi2IndirectAndMappedPrefix(void)
{
	uint8_t indirect_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	uint8_t mapped_bytes[APP_AI_XSPI2_PROBE_BYTES] = {0U};
	const int32_t disable_status = BSP_XSPI_NOR_DisableMemoryMappedMode(0U);

	if (disable_status != BSP_ERROR_NONE)
	{
		DebugConsole_Printf(
			"[AI] xSPI2 disable-mapped before compare returned %ld.\r\n",
			(long)disable_status);
	}

	if (BSP_XSPI_NOR_Read(0U, indirect_bytes, 0U,
						  APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE)
	{
		DebugConsole_Printf("[AI] xSPI2 indirect prefix read failed.\r\n");
	}
	else
	{
		AppAI_LogXspi2PrefixBytes("xSPI2 indirect prefix:", indirect_bytes);
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE)
	{
		DebugConsole_Printf("[AI] xSPI2 re-enable mapped compare failed.\r\n");
		return;
	}

	(void)mcu_cache_invalidate_range(APP_AI_XSPI2_MODEL_BASE_ADDR,
									 APP_AI_XSPI2_MODEL_BASE_ADDR + APP_AI_XSPI2_PROBE_BYTES);
	(void)memcpy(mapped_bytes, (const void *)APP_AI_XSPI2_MODEL_BASE_ADDR,
				 APP_AI_XSPI2_PROBE_BYTES);
	AppAI_LogXspi2PrefixBytes("xSPI2 mapped prefix:", mapped_bytes);
}

static void AppAI_LogFloatApprox(const char *label, float value)
{
	union
	{
		float f;
		uint32_t u;
	} bits = {
		.f = value};
	unsigned long magnitude_whole = 0U;
	unsigned long magnitude_frac = 0U;
	const char *sign = "";
	double abs_value = 0.0;

	if (label == NULL)
	{
		return;
	}

	if ((bits.u & 0x7F800000U) == 0x7F800000U)
	{
		if ((bits.u & 0x007FFFFFU) != 0U)
		{
			DebugConsole_Printf("%sNaN\r\n", label);
		}
		else if ((bits.u & 0x80000000U) != 0U)
		{
			DebugConsole_Printf("%s-Inf\r\n", label);
		}
		else
		{
			DebugConsole_Printf("%s+Inf\r\n", label);
		}
		return;
	}

	if ((bits.u & 0x80000000U) != 0U)
	{
		sign = "-";
	}

	abs_value = (bits.u & 0x80000000U) != 0U ? -(double)value : (double)value;
	if (abs_value < 0.0)
	{
		abs_value = 0.0;
	}

	magnitude_whole = (unsigned long)abs_value;
	magnitude_frac = (unsigned long)((abs_value - (double)magnitude_whole) * 1000000.0 + 0.5);
	if (magnitude_frac >= 1000000U)
	{
		magnitude_whole++;
		magnitude_frac -= 1000000U;
	}

	DebugConsole_Printf("%s%s%lu.%06lu\r\n", label, sign,
						magnitude_whole, magnitude_frac);
}
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

/**
 * @brief Log the raw inference value and the calibrated board-facing value.
 *
 * This trace stays in the board UART log so we can tell whether a miss comes
 * from the network itself or from the postprocess calibration.
 */
static float AppAI_TraceAndApplyInferenceCalibration(float raw_value)
{
	char line[96] = {0};
	/* Use local string copies to prevent pointer corruption from xSPI2 reconfiguration */
	static const char prefix_before[] = "[AI] Model output before calibration: ";
	static const char prefix_after[] = "[AI] Model output after calibration: ";
	static const char prefix_delta[] = "[AI] Calibration delta: ";
	const float calibrated_value = AppInferenceCalibration_Apply(raw_value);

	AppInferenceLog_FormatFloatMicros(line, sizeof(line), prefix_before, raw_value);
	DebugConsole_WriteString(line);
	AppInferenceLog_FormatFloatMicros(line, sizeof(line), prefix_after, calibrated_value);
	DebugConsole_WriteString(line);

	if (AppAI_IsFiniteFloat(raw_value) && AppAI_IsFiniteFloat(calibrated_value))
	{
		AppInferenceLog_FormatFloatMicros(line, sizeof(line), prefix_delta,
										  calibrated_value - raw_value);
		DebugConsole_WriteString(line);
	}
	else
	{
		DebugConsole_WriteString(
			"[AI] Calibration delta: unavailable (non-finite input or output)\r\n");
	}

	return calibrated_value;
}

#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
/**
 * @brief Reset the tiny burst history used to stabilize the AI output.
 */
static void AppAI_ResetInferenceBurstHistory(void)
{
	(void)memset(app_ai_inference_burst_history, 0,
				 sizeof(app_ai_inference_burst_history));
	app_ai_inference_burst_history_count = 0U;
	app_ai_inference_burst_history_next_index = 0U;
}
#endif /* APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING */

static bool AppAI_RuntimeInitStepwise(void)
{
	uint32_t t = 0U;

	/* Let the vendor runtime perform the low-level ATON bring-up and version
	 * compatibility checks. Our wrapper only handles the OSAL and IRQ setup. */
	(void)DebugConsole_WriteString("[AI] ATON runtime init start.\r\n");
	if (LL_ATON_Init() != LL_ATON_OK)
	{
		(void)DebugConsole_WriteString(
			"[AI] ATON runtime init failed in LL_ATON_Init().\r\n");
		return false;
	}

	ATON_DISABLE_CLR_CONFCLR(INTCTRL, 0);
	ATON_INTCTRL_STD_INTORMSK_SET(ATON_STRENG_INT_MASK(ATON_STRENG_NUM, 0, 0));
	ATON_INTCTRL_STD_INTANDMSK_SET(0xFFFFFFFFU);
#if (ATON_INT_NR > 32)
	ATON_INTCTRL_STD_INTORMSK_H_SET(0xFFFFFFFFU);
	ATON_INTCTRL_STD_INTANDMSK_H_SET(0xFFFFFFFFU);
#endif
	ATON_ENABLE(INTCTRL, 0);

	LL_ATON_OSAL_INIT();

	LL_ATON_OSAL_DISABLE_IRQ(0U);
	LL_ATON_OSAL_DISABLE_IRQ(1U);
	LL_ATON_OSAL_DISABLE_IRQ(2U);
	LL_ATON_OSAL_DISABLE_IRQ(3U);

	LL_ATON_OSAL_ENABLE_IRQ(ATON_STD_IRQ_LINE);
	(void)DebugConsole_WriteString("[AI] ATON runtime init OK.\r\n");
	return true;
}

#if !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogXspi2FlashPrefix(void)
{
}

static void AppAI_LogXspi2MappedScaleBytes(void)
{
}

static void AppAI_LogXspi2IndirectAndMappedPrefix(void)
{
}

static void AppAI_LogFloatApprox(const char *label, float value)
{
	(void)label;
	(void)value;
}
#endif /* !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

static void AppAI_ConfigureNpuAccessControl(void)
{
	RIMC_MasterConfig_t npu_master = {0};

	/* Mirror the ST NPU examples so the runtime can access the cache and NPU
	 * control path with the expected secure/privileged attributes. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();
	__HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();

	/* The secure NPU validation app programs the NPU as secure + privileged.
	 * That matches our secure-side runtime more closely than the earlier NSEC
	 * experiment, and it avoids blocking the internal ATON control window. */
	npu_master.MasterCID = RIF_CID_1;
	npu_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &npu_master);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);

#if defined(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif

#if defined(RIF_RCC_PERIPH_INDEX_CACHECONFIG)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHECONFIG,
										  RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif
}

static void AppAI_EnableNpuMemoryAndCaches(void)
{
	/* Mirror the ST NPU examples so the memory fabric is actually usable by
	 * the runtime before the first ATON init call runs. */
	RCC->MEMENR |= RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN | RCC_MEMENR_AXISRAM5EN | RCC_MEMENR_AXISRAM6EN | RCC_MEMENR_CACHEAXIRAMEN;

	RAMCFG_SRAM2_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM3_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM4_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM5_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM6_AXI->CR &= ~RAMCFG_CR_SRAMSD;

