rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		(void)DebugConsole_WriteString(
			"[AI] Dry-run model init OK; launching rectifier stage.\r\n");

		if (AppAI_RunStageInference(&app_ai_rectifier_stage, safe_frame_bytes, frame_size,
								&full_frame_crop, &rectifier_output_info,
								&rectifier_output_value) &&
			AppAI_DecodeRectifierCropBox(rectifier_output_info, &scalar_crop,
								 &rectifier_box))
	{
		AppAI_LogRectifierResult(rectifier_output_info, &rectifier_box);
		DebugConsole_Printf(
			"[AI] Rectifier crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
		DebugConsole_Printf(
			"[AI] Scalar stage using rectifier crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
		scalar_crop_from_rectifier = true;
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Rectifier stage or decode failed; trying OBB fallback.\r\n");

#if APP_AI_ENABLE_OBB_STAGE != 0U
		(void)DebugConsole_WriteString("[AI] Dry-run model init OK; launching OBB fallback stage.\r\n");

		if (AppAI_RunStageInference(&app_ai_obb_stage, safe_frame_bytes, frame_size,
									&full_frame_crop, &obb_output_info, &obb_output_value) &&
			AppAI_DecodeObbCropBox(obb_output_info, &scalar_crop, &obb_box))
		{
			AppAI_LogObbResult(obb_output_info, &obb_box);
			DebugConsole_Printf(
				"[AI] OBB fallback crop: x=%lu y=%lu w=%lu h=%lu\r\n",
				(unsigned long)scalar_crop.x_min,
				(unsigned long)scalar_crop.y_min,
				(unsigned long)scalar_crop.width,
				(unsigned long)scalar_crop.height);
			DebugConsole_Printf(
				"[AI] Scalar stage using OBB fallback crop: x=%lu y=%lu w=%lu h=%lu\r\n",
				(unsigned long)scalar_crop.x_min,
				(unsigned long)scalar_crop.y_min,
				(unsigned long)scalar_crop.width,
				(unsigned long)scalar_crop.height);
			scalar_crop_from_obb = true;
		}
		else
#endif
		{
			(void)DebugConsole_WriteString(
				"[AI] OBB fallback failed; using fixed training crop.\r\n");
		}
	}

	}
	if (!scalar_crop_from_rectifier && !scalar_crop_from_obb && !scalar_crop_from_source_crop_box)
	{
		scalar_crop = fixed_training_crop;
		DebugConsole_Printf(
			"[AI] Fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
		DebugConsole_Printf(
			"[AI] Scalar stage using fixed training crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long)scalar_crop.x_min,
			(unsigned long)scalar_crop.y_min,
			(unsigned long)scalar_crop.width,
			(unsigned long)scalar_crop.height);
	}

#if APP_AI_BYPASS_SCALAR_STAGE_BEFORE_PREPROCESS
	if (scalar_crop_from_rectifier)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping rectifier-crop handoff.\r\n");
	}
	else if (scalar_crop_from_obb)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping OBB fallback handoff.\r\n");
	}
	else if (scalar_crop_from_source_crop_box)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping source-crop-box handoff.\r\n");
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar stage bypass active; skipping fixed-crop handoff.\r\n");
	}
	app_ai_last_inference_valid = false;
	app_ai_last_inference_value = 0.0f;
	return true;
#else
#if APP_AI_BYPASS_SCALAR_INFERENCE
	if (scalar_crop_from_rectifier)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; rectifier-crop preprocess-only mode enabled.\r\n");
	}
	else if (scalar_crop_from_obb)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; OBB fallback preprocess-only mode enabled.\r\n");
	}
	else if (scalar_crop_from_source_crop_box)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; source-crop-box preprocess-only mode enabled.\r\n");
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; preprocess-only mode enabled.\r\n");
	}
#else
	if (scalar_crop_from_rectifier)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; rectifier-crop scalar inference enabled.\r\n");
	}
	else if (scalar_crop_from_obb)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; OBB fallback scalar inference enabled.\r\n");
	}
	else if (scalar_crop_from_source_crop_box)
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; source-crop-box crop scalar inference enabled.\r\n");
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar handoff active; full scalar inference enabled.\r\n");
	}
#endif
	if (!AppAI_RunStageInference(&app_ai_scalar_stage, safe_frame_bytes, frame_size,
								 &scalar_crop, &scalar_output_info, &scalar_output_value))
	{
		(void)DebugConsole_WriteString("[AI] Dry-run entry aborted during scalar stage.\r\n");
		return false;
	}

	/* Log the inference result immediately after inference, before xSPI2
	 * reconfiguration for the next stage. */
	{
		char cached_output_line[96];
		AppInferenceLog_FormatFloatMicros(
			cached_output_line, sizeof(cached_output_line),
			"[AI] Model output (cached): ", scalar_output_value);
		DebugConsole_WriteString(cached_output_line);
	}
	app_ai_last_inference_value =
		AppAI_TraceAndApplyInferenceCalibration(scalar_output_value);
	app_ai_last_inference_valid = true;

	return true;
#endif
}

/* USER CODE END 0 */

/* USER CODE BEGIN 1 */

static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void)
{
	const LL_Buffer_InfoTypeDef *input_info =
		NN_Instance_polar_vote_circular_v28_int8.network
			->input_buffers_info();

	if ((input_info == NULL) || (input_info->name == NULL))
	{
		return NULL;
	}

	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void)
{
	const LL_Buffer_InfoTypeDef *output_info =
		NN_Instance_polar_vote_circular_v28_int8.network
			->output_buffers_info();

	if ((output_info == NULL) || (output_info->name == NULL))
	{
		return NULL;
	}

	return output_info;
}

