rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *name)
{
	if ((buffer_list == NULL) || (name == NULL))
	{
		return NULL;
	}

	for (const LL_Buffer_InfoTypeDef *entry = buffer_list; entry->name != NULL;
		 ++entry)
	{
		if (strcmp(entry->name, name) == 0)
		{
			return entry;
		}
	}

	return NULL;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindFirstBufferInfoByNames(
	const LL_Buffer_InfoTypeDef *buffer_list, const char *const *names,
	size_t name_count)
{
	if ((buffer_list == NULL) || (names == NULL) || (name_count == 0U))
	{
		return NULL;
	}

	for (size_t index = 0U; index < name_count; ++index)
	{
		const LL_Buffer_InfoTypeDef *buffer_info = AppAI_FindBufferInfoByName(
			buffer_list, names[index]);

		if (buffer_info != NULL)
		{
			return buffer_info;
		}
	}

	return NULL;
}

static void AppAI_LogScalarInternalOutputProbe(
	const AppAI_ModelStageSpec *stage,
	const LL_Buffer_InfoTypeDef *stage_output_info)
{
	static const char *const raw_head_names[] = {
		"Quantize_261_out_0",
		"Quantize_390_out_0",
		"Input_28_out_0",
		"Gemm_271_out_0",
		"Gemm_out_0",
		"Identity_out_0",
	};
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *raw_head_info = NULL;
	static bool internal_name_dump_done = false;

	/* Keep this probe specific to the scalar model so we can confirm whether
	 * the runtime is updating the raw head tensor when final output is stale. */
	if ((stage == NULL) || (stage != &app_ai_scalar_stage))
	{
		return;
	}

	internal_buffers =
		LL_ATON_Internal_Buffers_Info_polar_vote_circular_v28_int8();
	if ((internal_buffers != NULL) && !internal_name_dump_done)
	{
		size_t entry_index = 0U;
		for (const LL_Buffer_InfoTypeDef *entry = internal_buffers;
			 (entry->name != NULL) && (entry_index < 48U);
			 ++entry, ++entry_index)
		{
			DebugConsole_Printf(
				"[AI] Scalar internal[%lu]: name=%s len=%lu nbits=%lu\r\n",
				(unsigned long)entry_index,
				entry->name,
				(unsigned long)LL_Buffer_len(entry),
				(unsigned long)entry->nbits);
		}
		internal_name_dump_done = true;
	}

	raw_head_info = AppAI_FindFirstBufferInfoByNames(
		internal_buffers,
		raw_head_names,
		sizeof(raw_head_names) / sizeof(raw_head_names[0]));

	if ((raw_head_info != NULL) && (LL_Buffer_addr_start(raw_head_info) != NULL) &&
		(LL_Buffer_len(raw_head_info) > 0U))
	{
		const uint8_t *raw_head_ptr =
			(const uint8_t *)LL_Buffer_addr_start(raw_head_info);
		const size_t raw_head_len = (size_t)LL_Buffer_len(raw_head_info);
		const size_t raw_dump_len = (raw_head_len < 8U) ? raw_head_len : 8U;

		(void)mcu_cache_invalidate_range((uint32_t)(uintptr_t)raw_head_ptr,
										 (uint32_t)((uintptr_t)raw_head_ptr + raw_head_len));
		DebugConsole_Printf(
			"[AI] Scalar raw-head: name=%s len=%lu q0=%d bytes=[%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(raw_head_info->name != NULL) ? raw_head_info->name : "(unnamed)",
			(unsigned long)raw_head_len,
			(int)(*(const int8_t *)raw_head_ptr),
			(raw_dump_len > 0U) ? raw_head_ptr[0] : 0U,
			(raw_dump_len > 1U) ? raw_head_ptr[1] : 0U,
			(raw_dump_len > 2U) ? raw_head_ptr[2] : 0U,
			(raw_dump_len > 3U) ? raw_head_ptr[3] : 0U,
			(raw_dump_len > 4U) ? raw_head_ptr[4] : 0U,
			(raw_dump_len > 5U) ? raw_head_ptr[5] : 0U,
			(raw_dump_len > 6U) ? raw_head_ptr[6] : 0U,
			(raw_dump_len > 7U) ? raw_head_ptr[7] : 0U);
	}
	else
	{
		(void)DebugConsole_WriteString(
			"[AI] Scalar raw-head probe unavailable.\r\n");
	}

	if ((stage_output_info != NULL) &&
		(LL_Buffer_addr_start(stage_output_info) != NULL) &&
		(LL_Buffer_len(stage_output_info) >= 4U))
	{
		const uint8_t *out_ptr =
			(const uint8_t *)LL_Buffer_addr_start(stage_output_info);
		const size_t out_len = (size_t)LL_Buffer_len(stage_output_info);

		DebugConsole_Printf(
			"[AI] Scalar final-out: name=%s len=%lu bytes=[%02X %02X %02X %02X]\r\n",
			(stage_output_info->name != NULL) ? stage_output_info->name : "(unnamed)",
			(unsigned long)out_len,
			out_ptr[0], out_ptr[1], out_ptr[2], out_ptr[3]);
	}
}

#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
static void AppAI_LogInferenceResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info)
{
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *quantize_output_info = NULL;
	const LL_Buffer_InfoTypeDef *sub_output_info = NULL;
	const LL_Buffer_InfoTypeDef *conv1_output_info = NULL;
	const LL_Buffer_InfoTypeDef *raw_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scale_info = NULL;
	const LL_Buffer_InfoTypeDef *zero_point_info = NULL;
	union
	{
		float f;
		uint32_t u;
	} output_bits = {
		.f = 0.0f};
	float output_value = 0.0f;
	float head_scale = 1.0f;
	float output_dequant_scale = 1.0f;
	float head_dequant_value = 0.0f;
	int8_t raw_output_value = 0;
	int8_t head_zero_point = 0;
	int8_t output_zero_point = 0;
	static const char *const quantize_output_names[] = {
		"Sub_24_out_0",
		"Conv2D_25_zero_off_out_25",
	};
	static const char *const sub_output_names[] = {
		"Conv2D_25_zero_off_out_25",
		"Conv2D_30_zero_off_out_34",
	};
	static const char *const conv1_output_names[] = {
		"Conv2D_34_zero_off_out_43",
		"Conv2D_42_zero_off_out_61",
		"Conv2D_46_zero_off_out_70",
	};
	static const char *const raw_output_names[] = {
		"Quantize_261_out_0",
		"Quantize_390_out_0",
		"Gemm_271_out_0",
	};
	static const char *const scale_names[] = {
		"Dequantize_319_x_scale",
	};
	static const char *const zero_point_names[] = {
		"Dequantize_319_x_zero_point",
	};

	if (output_buffer_info == NULL)
	{
		DebugConsole_Printf("[AI] Inference failed: no output buffer.\r\n");
		return;
	}

	DebugConsole_Printf(
		"[AI] Output buffer meta: name=%s addr=%p len=%lu\r\n",
		(output_buffer_info->name != NULL) ? output_buffer_info->name : "(unnamed)",
		LL_Buffer_addr_start(output_buffer_info),
		(unsigned long)LL_Buffer_len(output_buffer_info));

