rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	(void)memcpy(&output_bits.u, LL_Buffer_addr_start(output_buffer_info),
				 sizeof(output_bits.u));
	output_value = output_bits.f;

	internal_buffers =
		LL_ATON_Internal_Buffers_Info(
			&NN_Instance_polar_vote_circular_v28_int8);
	quantize_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
															quantize_output_names, sizeof(quantize_output_names) / sizeof(quantize_output_names[0]));
	sub_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   sub_output_names, sizeof(sub_output_names) / sizeof(sub_output_names[0]));
	conv1_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
														 conv1_output_names, sizeof(conv1_output_names) / sizeof(conv1_output_names[0]));
	raw_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   raw_output_names, sizeof(raw_output_names) / sizeof(raw_output_names[0]));
	scale_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
												  scale_names, sizeof(scale_names) / sizeof(scale_names[0]));
	zero_point_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
													   zero_point_names, sizeof(zero_point_names) / sizeof(zero_point_names[0]));

	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogBufferInfoAndSignature("input tensor", quantize_output_info);
		AppAI_LogBufferInfoAndSignature("preprocess output", sub_output_info);
		AppAI_LogBufferInfoAndSignature("first conv", conv1_output_info);
		AppAI_LogBufferInfoAndSignature("raw head", raw_output_info);
		AppAI_LogBufferInfoAndSignature("network output", output_buffer_info);
	}

	/* Dump the first 16 raw bytes of both the head output and the final network
	 * output so we can tell whether the inference engine wrote anything at all
	 * and whether the int8 value being read is actually at offset 0. */
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS && (raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL))
	{
		const uint8_t *p = (const uint8_t *)LL_Buffer_addr_start(raw_output_info);
		const size_t n = LL_Buffer_len(raw_output_info);
		DebugConsole_Printf(
			"[AI] Scalar raw-head bytes (len=%lu): "
			"[%02X %02X %02X %02X %02X %02X %02X %02X "
			"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long)n,
			(n > 0U) ? p[0] : 0U, (n > 1U) ? p[1] : 0U,
			(n > 2U) ? p[2] : 0U, (n > 3U) ? p[3] : 0U,
			(n > 4U) ? p[4] : 0U, (n > 5U) ? p[5] : 0U,
			(n > 6U) ? p[6] : 0U, (n > 7U) ? p[7] : 0U,
			(n > 8U) ? p[8] : 0U, (n > 9U) ? p[9] : 0U,
			(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
			(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
			(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS && (output_buffer_info != NULL) && (LL_Buffer_addr_start(output_buffer_info) != NULL))
	{
		const uint8_t *p = (const uint8_t *)LL_Buffer_addr_start(output_buffer_info);
		const size_t n = LL_Buffer_len(output_buffer_info);
		DebugConsole_Printf(
			"[AI] Scalar network-output bytes (len=%lu): "
			"[%02X %02X %02X %02X %02X %02X %02X %02X "
			"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long)n,
			(n > 0U) ? p[0] : 0U, (n > 1U) ? p[1] : 0U,
			(n > 2U) ? p[2] : 0U, (n > 3U) ? p[3] : 0U,
			(n > 4U) ? p[4] : 0U, (n > 5U) ? p[5] : 0U,
			(n > 6U) ? p[6] : 0U, (n > 7U) ? p[7] : 0U,
			(n > 8U) ? p[8] : 0U, (n > 9U) ? p[9] : 0U,
			(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
			(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
			(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}

	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL))
	{
		raw_output_value = *(const int8_t *)LL_Buffer_addr_start(raw_output_info);
	}

	{
		char raw_output_line[64] = {0};

		(void)DebugConsole_Snprintf(raw_output_line, sizeof(raw_output_line),
					   "[AI] Raw output int8: %d\r\n", (int)raw_output_value);
		DebugConsole_WriteString(raw_output_line);
	}

	DebugConsole_Printf(
		"[AI] Raw tensor meta: name=%s addr=%p len=%lu\r\n",
		(raw_output_info != NULL) ? raw_output_info->name : "(missing)",
		(raw_output_info != NULL) ? (void *)LL_Buffer_addr_start(raw_output_info) : NULL,
		(raw_output_info != NULL) ? (unsigned long)LL_Buffer_len(raw_output_info) : 0UL);

	if ((scale_info != NULL) && (LL_Buffer_addr_start(scale_info) != NULL))
	{
		(void)memcpy(&output_dequant_scale, LL_Buffer_addr_start(scale_info),
					 sizeof(output_dequant_scale));
	}

	if ((zero_point_info != NULL) && (LL_Buffer_addr_start(zero_point_info) != NULL))
	{
		output_zero_point = *(const int8_t *)LL_Buffer_addr_start(
			zero_point_info);
	}

	if (raw_output_info != NULL)
	{
		const void *raw_output_addr = LL_Buffer_addr_start(raw_output_info);

		if (raw_output_addr != NULL)
		{
			raw_output_value = *(const int8_t *)raw_output_addr;
			if ((raw_output_info->scale != NULL) && (raw_output_info->offset != NULL))
			{
				(void)memcpy(&head_scale, raw_output_info->scale,
							 sizeof(head_scale));
				head_zero_point = *(const int16_t *)raw_output_info->offset;
			}
			head_dequant_value = ((float)raw_output_value - (float)head_zero_point) * head_scale;
		}
	}

	output_value = AppAI_TraceAndApplyInferenceCalibration(output_value);
	if (!AppAI_IsFiniteFloat(output_value))
	{
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
		DebugConsole_WriteString(
			"[AI] Inference result is non-finite; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
	if (!AppAI_IsPlausibleInferenceValue(output_value))
	{
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
		DebugConsole_WriteString(
			"[AI] Inference result out of plausible range; skipping publish/update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
	output_value = AppAI_FilterInferenceValue(output_value);
#endif

	/* Log both the final float output and the raw int8 tensor so we can spot
	 * quantization mismatches without changing the model result path. */
	DebugConsole_Printf(
		"[AI] raw=%d head_zp=%d output_bits=0x%08lx output_zp=%d\r\n",
		(int)raw_output_value,
		(int)head_zero_point,
		(unsigned long)output_bits.u,
		(int)output_zero_point);
	if (APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS)
	{
		AppAI_LogFloatApprox("[AI] head_scale: ", head_scale);
		AppAI_LogFloatApprox("[AI] head_dequant: ", head_dequant_value);
		AppAI_LogFloatApprox("[AI] output_scale: ", output_dequant_scale);
		AppAI_LogFloatApprox("[AI] output_zero_point: ",
							 (float)output_zero_point);
		AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);
	}

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;
}
#else
static void AppAI_LogInferenceResult(
	const LL_Buffer_InfoTypeDef *output_buffer_info)
{
	float output_value = 0.0f;
	char line[64] = {0};

