rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	if ((output_buffer_info == NULL) || (LL_Buffer_addr_start(output_buffer_info) == NULL) || (LL_Buffer_len(output_buffer_info) < sizeof(output_value)))
	{
		return;
	}

	(void)memcpy(&output_value, LL_Buffer_addr_start(output_buffer_info),
				 sizeof(output_value));
	output_value = AppAI_TraceAndApplyInferenceCalibration(output_value);
	if (!AppAI_IsFiniteFloat(output_value))
	{
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference value: ", output_value);
		DebugConsole_WriteString(line);
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference exact: ", output_value);
		DebugConsole_WriteString(line);
		DebugConsole_WriteString(
			"[AI] Inference result is non-finite; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
	if (!AppAI_IsPlausibleInferenceValue(output_value))
	{
		AppInferenceLog_FormatFloatMicros(line, sizeof(line),
										  "[AI] Inference value: ", output_value);
		DebugConsole_WriteString(line);
		DebugConsole_WriteString(
			"[AI] Inference result out of plausible range; skipping smoothing and last-result update.\r\n");
		app_ai_last_inference_valid = false;
		return;
	}
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
	output_value = AppAI_FilterInferenceValue(output_value);
#endif

	AppInferenceLog_FormatFloatMicros(line, sizeof(line),
									  "[AI] Inference value: ", output_value);
	DebugConsole_WriteString(line);

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;

#if APP_AI_ENABLE_RUNTIME_METRICS
	/* Log final power consumption and end metrics tracking */
	(void)INA219_LogReading("CNN-DONE");
	Metrics_EndInference(output_value);
#endif
}
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */

#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
/**
 * @brief Smooth the user-facing inference value across captures.
 *
 * A 3-frame burst median keeps the live reading from jumping on glare or a
 * single noisy capture while still tracking slow changes.
 */
static float AppAI_FilterInferenceValue(float value)
{
	float ordered[APP_AI_INFERENCE_BURST_HISTORY_SIZE] = {0.0f};
	size_t sample_count = 0U;
	size_t start_index = 0U;

	if (!AppAI_IsFiniteFloat(value))
	{
		if (app_ai_inference_burst_history_count > 0U)
		{
			const size_t last_index =
				(app_ai_inference_burst_history_next_index + APP_AI_INFERENCE_BURST_HISTORY_SIZE - 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;
			const float last_value =
				app_ai_inference_burst_history[last_index];

			if (AppAI_IsFiniteFloat(last_value))
			{
				return last_value;
			}
		}
		return value;
	}

	if (app_ai_inference_burst_history_count > 0U)
	{
		const size_t last_index =
			(app_ai_inference_burst_history_next_index + APP_AI_INFERENCE_BURST_HISTORY_SIZE - 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;
		float delta = value - app_ai_inference_burst_history[last_index];

		if (delta < 0.0f)
		{
			delta = -delta;
		}

		if (delta > APP_AI_INFERENCE_BURST_RESET_DELTA_C)
		{
			AppAI_ResetInferenceBurstHistory();
		}
	}

	app_ai_inference_burst_history[app_ai_inference_burst_history_next_index] =
		value;
	if (app_ai_inference_burst_history_count <
		APP_AI_INFERENCE_BURST_HISTORY_SIZE)
	{
		app_ai_inference_burst_history_count++;
	}
	app_ai_inference_burst_history_next_index =
		(app_ai_inference_burst_history_next_index + 1U) % APP_AI_INFERENCE_BURST_HISTORY_SIZE;

	sample_count = app_ai_inference_burst_history_count;
	start_index = (sample_count < APP_AI_INFERENCE_BURST_HISTORY_SIZE) ? 0U
																	   : app_ai_inference_burst_history_next_index;

	for (size_t i = 0U; i < sample_count; ++i)
	{
		ordered[i] =
			app_ai_inference_burst_history[(start_index + i) % APP_AI_INFERENCE_BURST_HISTORY_SIZE];
	}

	/* Keep the local copy sorted so we can choose the median for the full
	 * 3-sample burst and a simple average during warm-up. */
	for (size_t i = 1U; i < sample_count; ++i)
	{
		const float key = ordered[i];
		size_t j = i;

		while ((j > 0U) && (ordered[j - 1U] > key))
		{
			ordered[j] = ordered[j - 1U];
			--j;
		}

		ordered[j] = key;
	}

	if (sample_count == 1U)
	{
		return ordered[0U];
	}

	if (sample_count == 2U)
	{
		return 0.5f * (ordered[0U] + ordered[1U]);
	}

	return ordered[sample_count / 2U];
}
#endif /* APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING */

/**
 * @brief Return true only for ordinary finite float values.
 */
static bool AppAI_IsFiniteFloat(float value)
{
	union
	{
		float f;
		uint32_t u;
	} bits = {
		.f = value};

	return ((bits.u & 0x7F800000U) != 0x7F800000U);
}

/**
 * @brief Bound-check the calibrated scalar inference before publish/log.
 */
static bool AppAI_IsPlausibleInferenceValue(float value)
{
	if (!AppAI_IsFiniteFloat(value))
	{
		return false;
	}

	if (value < APP_AI_INFERENCE_VALUE_MIN_C)
	{
		return false;
	}

	if (value > APP_AI_INFERENCE_VALUE_MAX_C)
	{
		return false;
	}

	return true;
}

static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
								 bool clean, bool invalidate)
{
	uintptr_t start = 0U;
	uintptr_t end = 0U;

	if (end_addr <= start_addr)
	{
		return -1;
	}

	start = (uintptr_t)start_addr;
	end = (uintptr_t)end_addr;

	start &= ~((uintptr_t)APP_AI_CACHE_LINE_BYTES - 1U);
	end = (end + APP_AI_CACHE_LINE_BYTES - 1U) & ~((uintptr_t)APP_AI_CACHE_LINE_BYTES - 1U);

	if (clean)
	{
		SCB_CleanDCache_by_Addr((uint32_t *)start, (int32_t)(end - start));
	}

	if (invalidate)
	{
		SCB_InvalidateDCache_by_Addr((uint32_t *)start,
									 (int32_t)(end - start));
	}

return 0;
}

static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
									size_t frame_size_bytes,
									size_t frame_width_pixels, size_t source_x, size_t source_y);

static float AppAI_ReadNormalizedGrayFromYuv422Bilinear(
	const uint8_t *frame_bytes, size_t frame_size_bytes,
	size_t frame_width_pixels, size_t frame_height_pixels,
	float source_x, float source_y)
{
	/* Add additional bounds checking */
	if ((frame_bytes == NULL) || (frame_size_bytes < 4U) ||
		(frame_width_pixels == 0U) || (frame_height_pixels == 0U))
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid parameters\r\n");
		return 0.0f;
	}

