rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	/* Add bounds checking for source coordinates */
	if (source_x < 0.0f || source_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Negative coordinates: x=%f, y=%f\r\n", 
						   (double)source_x, (double)source_y);
		source_x = (source_x < 0.0f) ? 0.0f : source_x;
		source_y = (source_y < 0.0f) ? 0.0f : source_y;
	}

	const float max_x = (frame_width_pixels > 0U) ? (float)(frame_width_pixels - 1U)
												 : 0.0f;
	const float max_y = (frame_height_pixels > 0U) ? (float)(frame_height_pixels - 1U)
												  : 0.0f;

	/* Add additional bounds checking for max values */
	if (max_x < 0.0f || max_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid max values: max_x=%f, max_y=%f\r\n", 
						   (double)max_x, (double)max_y);
		return 0.0f;
	}

	float clamped_x = source_x;
	float clamped_y = source_y;

	if (clamped_x > max_x)
	{
		clamped_x = max_x;
	}

	if (clamped_y > max_y)
	{
		clamped_y = max_y;
	}

	/* Add additional validation for clamped coordinates */
	if (clamped_x < 0.0f || clamped_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Clamped coordinates negative: x=%f, y=%f\r\n", 
						   (double)clamped_x, (double)clamped_y);
		return 0.0f;
	}

	const size_t x0 = (size_t)floorf(clamped_x);
	const size_t y0 = (size_t)floorf(clamped_y);
	
	/* Add bounds checking for x0 and y0 */
	if (x0 >= frame_width_pixels || y0 >= frame_height_pixels)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: x0/y0 out of bounds: x0=%lu, y0=%lu, width=%lu, height=%lu\r\n", 
						   (unsigned long)x0, (unsigned long)y0, 
						   (unsigned long)frame_width_pixels, (unsigned long)frame_height_pixels);
		return 0.0f;
	}

	const size_t x1 = (x0 + 1U < frame_width_pixels) ? (x0 + 1U) : x0;
	const size_t y1 = (y0 + 1U < frame_height_pixels) ? (y0 + 1U) : y0;
	const float fx = clamped_x - (float)x0;
	const float fy = clamped_y - (float)y0;
	
	/* Add bounds checking for fx and fy */
	if (fx < 0.0f || fx > 1.0f || fy < 0.0f || fy > 1.0f)
	{
		DebugConsole_Printf("[AI] ReadNormalizedGrayFromYuv422Bilinear: Invalid fx/fy: fx=%f, fy=%f\r\n", 
						   (double)fx, (double)fy);
	}

	/* Add bounds checking for AppAI_ReadYuv422Luma calls */
	const uint8_t luma00 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x0, y0);
	const uint8_t luma10 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x1, y0);
	const uint8_t luma01 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x0, y1);
	const uint8_t luma11 = AppAI_ReadYuv422Luma(frame_bytes, frame_size_bytes,
												frame_width_pixels, x1, y1);
	const float l00 = (float)luma00 / 255.0f;
	const float l10 = (float)luma10 / 255.0f;
	const float l01 = (float)luma01 / 255.0f;
	const float l11 = (float)luma11 / 255.0f;
	const float top = l00 + (fx * (l10 - l00));
	const float bottom = l01 + (fx * (l11 - l01));
	const float gray = top + (fy * (bottom - top));

	/* Add bounds checking for final gray value */
	if (gray < 0.0f)
	{
		return 0.0f;
	}

	if (gray > 1.0f)
	{
		return 1.0f;
	}

	return gray;
}

static bool __attribute__((noinline)) AppAI_PreprocessScalarRow(
	const uint8_t *frame_bytes, size_t frame_size, size_t source_width,
	size_t source_height, size_t crop_x_min, size_t crop_y_min,
	size_t crop_width, size_t crop_height, size_t output_width,
	size_t output_height, float resize_scale, size_t resized_width,
	size_t resized_height, size_t resize_pad_x, size_t resize_pad_y,
	size_t out_y, float *input_ptr, size_t input_len_bytes)
{
	/* Add bounds checking for parameters */
	if ((frame_bytes == NULL) || (input_ptr == NULL) || (source_width == 0) || (source_height == 0))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: Invalid parameters\r\n");
		return false;
	}

#if APP_AI_YUV422_INPUT_LUMA_ONLY
	if ((out_y < resize_pad_y) || (out_y >= (resize_pad_y + resized_height)))
	{
		return true;
	}
#endif

	const size_t row_len = output_width * 3U * sizeof(float);
	const size_t row_offset = (out_y * output_width) * 3U * sizeof(float);
	
	/* Add additional bounds checking for row_offset */
	if (row_offset >= input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: row_offset out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)row_offset, (unsigned long)input_len_bytes);
		return false;
	}
	
	/* Add additional bounds checking for row_len */
	if ((row_offset + row_len) > input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: row_len out of bounds: %lu + %lu > %lu\r\n", 
						   (unsigned long)row_offset, (unsigned long)row_len, (unsigned long)input_len_bytes);
		return false;
	}
	
	uint8_t *const row_bytes = (uint8_t *)input_ptr + row_offset;

	if ((row_bytes == NULL) || (frame_bytes == NULL))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: NULL pointer detected\r\n");
		return false;
	}
	if ((row_offset + row_len) > input_len_bytes)
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: Buffer overflow detected\r\n");
		return false;
	}

	for (size_t out_x = 0U; out_x < output_width; out_x++)
	{
		/* Add bounds checking for out_x */
		if (out_x >= output_width)
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: out_x out of bounds: %lu >= %lu\r\n", 
							   (unsigned long)out_x, (unsigned long)output_width);
			return false;
		}
		
#if APP_AI_YUV422_INPUT_LUMA_ONLY
		const size_t pixel_base = out_x * 3U * sizeof(float);
		
		/* Add bounds checking for pixel_base */
		if ((pixel_base + 11U) >= (output_width * 3U * sizeof(float)))
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: pixel_base out of bounds: %lu >= %lu\r\n", 
							   (unsigned long)(pixel_base + 11U), (unsigned long)(output_width * 3U * sizeof(float)));
			return false;
		}
		
		uint32_t gray_bits = 0U;

		if ((out_x >= resize_pad_x) &&
			(out_x < (resize_pad_x + resized_width)))
		{
			const size_t resized_x = out_x - resize_pad_x;
			const size_t resized_y = out_y - resize_pad_y;
			size_t sample_x = crop_x_min + ((resized_x * crop_width) / resized_width);
			size_t sample_y = crop_y_min + ((resized_y * crop_height) / resized_height);

			/* Clamp the nearest-neighbor sample point to the crop bounds. */
			if (sample_x >= (crop_x_min + crop_width))
			{
				sample_x = crop_x_min + crop_width - 1U;
			}
			if (sample_y >= (crop_y_min + crop_height))
			{
				sample_y = crop_y_min + crop_height - 1U;
			}

			/* Read the luma sample directly so the hot row loop stays in the
			 * lightweight nearest-neighbor path. */
			const size_t source_index =
				(((sample_y * source_width) + (sample_x & ~1U)) * 2U) +
				((sample_x & 1U) ? 2U : 0U);
			const uint8_t gray = frame_bytes[source_index];

			{
				union
				{
					float f;
					uint32_t u;
				} gray_value = {
					.f = ((float)gray) / 255.0f};
				gray_bits = gray_value.u;
			}
		}
		{
			const uint8_t *const gray_bytes = (const uint8_t *)&gray_bits;

