rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
			/* Write the float bytes one at a time so the compiler cannot turn the
			 * store into an alignment-sensitive wide access on this board. */
			row_bytes[pixel_base + 0U] = gray_bytes[0];
			row_bytes[pixel_base + 1U] = gray_bytes[1];
			row_bytes[pixel_base + 2U] = gray_bytes[2];
			row_bytes[pixel_base + 3U] = gray_bytes[3];

			row_bytes[pixel_base + 4U] = gray_bytes[0];
			row_bytes[pixel_base + 5U] = gray_bytes[1];
			row_bytes[pixel_base + 6U] = gray_bytes[2];
			row_bytes[pixel_base + 7U] = gray_bytes[3];

			row_bytes[pixel_base + 8U] = gray_bytes[0];
			row_bytes[pixel_base + 9U] = gray_bytes[1];
			row_bytes[pixel_base + 10U] = gray_bytes[2];
			row_bytes[pixel_base + 11U] = gray_bytes[3];
		}
#else
	if ((out_y < resize_pad_y) || (out_y >= (resize_pad_y + resized_height)))
	{
		/* Add bounds checking for memset */
		const size_t memset_len = output_width * 3U * sizeof(float);
		if ((row_offset + memset_len) <= input_len_bytes)
		{
			(void)memset(row_bytes, 0, memset_len);
		}
		else
		{
			DebugConsole_Printf("[AI] PreprocessScalarRow: memset would overflow buffer\r\n");
		}
		return true;
	}

	const size_t pixel_base = out_x * 3U * sizeof(float);
	
	/* Add bounds checking for pixel_base */
	if ((pixel_base + 11U) >= (output_width * 3U * sizeof(float)))
	{
		DebugConsole_Printf("[AI] PreprocessScalarRow: pixel_base out of bounds: %lu >= %lu\r\n", 
						   (unsigned long)(pixel_base + 11U), (unsigned long)(output_width * 3U * sizeof(float)));
		return false;
	}
	
	float out_r_bits = 0.0f;
	float out_g_bits = 0.0f;
	float out_b_bits = 0.0f;

		if ((out_x >= resize_pad_x) &&
			(out_x < (resize_pad_x + resized_width)))
		{
			const float resized_x = (float)(out_x - resize_pad_x);
			const float resized_y = (float)(out_y - resize_pad_y);
			float crop_x = ((resized_x + 0.5f) / resize_scale) - 0.5f;
			float crop_y = ((resized_y + 0.5f) / resize_scale) - 0.5f;

			/* Add bounds checking for crop coordinates */
			if (crop_x < 0.0f)
			{
				crop_x = 0.0f;
			}
			else if (crop_x > (float)(crop_width - 1U))
			{
				crop_x = (float)(crop_width - 1U);
			}

			if (crop_y < 0.0f)
			{
				crop_y = 0.0f;
			}
			else if (crop_y > (float)(crop_height - 1U))
			{
				crop_y = (float)(crop_height - 1U);
			}

			/* Add bounds checking for crop_x_min and crop_y_min */
			const float total_crop_x = (float)crop_x_min + crop_x;
			const float total_crop_y = (float)crop_y_min + crop_y;
			
			if (total_crop_x >= 0.0f && total_crop_x < (float)source_width &&
				total_crop_y >= 0.0f && total_crop_y < (float)source_height)
			{
				AppAI_ReadRgbFromYuv422Bilinear(
					frame_bytes, frame_size, source_width, source_height,
					total_crop_x, total_crop_y,
					&out_r_bits, &out_g_bits, &out_b_bits);
			}
			else
			{
				DebugConsole_Printf("[AI] PreprocessScalarRow: Crop coordinates out of bounds: x=%f, y=%f\r\n", 
								   (double)total_crop_x, (double)total_crop_y);
				out_r_bits = 0.0f;
				out_g_bits = 0.0f;
				out_b_bits = 0.0f;
			}
		}

		out_r_bits = AppAI_ClampNormalizedFloat(out_r_bits);
		out_g_bits = AppAI_ClampNormalizedFloat(out_g_bits);
		out_b_bits = AppAI_ClampNormalizedFloat(out_b_bits);
		{
			const uint8_t *const r_bytes = (const uint8_t *)&out_r_bits;
			const uint8_t *const g_bytes = (const uint8_t *)&out_g_bits;
			const uint8_t *const b_bytes = (const uint8_t *)&out_b_bits;

			row_bytes[pixel_base + 0U] = r_bytes[0];
			row_bytes[pixel_base + 1U] = r_bytes[1];
			row_bytes[pixel_base + 2U] = r_bytes[2];
			row_bytes[pixel_base + 3U] = r_bytes[3];

			row_bytes[pixel_base + 4U] = g_bytes[0];
			row_bytes[pixel_base + 5U] = g_bytes[1];
			row_bytes[pixel_base + 6U] = g_bytes[2];
			row_bytes[pixel_base + 7U] = g_bytes[3];

			row_bytes[pixel_base + 8U] = b_bytes[0];
			row_bytes[pixel_base + 9U] = b_bytes[1];
			row_bytes[pixel_base + 10U] = b_bytes[2];
			row_bytes[pixel_base + 11U] = b_bytes[3];
		}
#endif
	}

	return true;
}

static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToFloatInput(
	const uint8_t *frame_bytes, size_t frame_size, float *input_ptr,
	size_t input_float_count, size_t input_len_bytes)
{
	/* Add additional bounds checking and validation */
	if ((frame_bytes == NULL) || (input_ptr == NULL))
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: NULL pointers\r\n");
		return false;
	}

	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;

	/* Add additional validation for source dimensions */
	if (source_width == 0U || source_height == 0U)
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Invalid source dimensions: width=%lu, height=%lu\r\n", 
						   (unsigned long)source_width, (unsigned long)source_height);
		return false;
	}

	/* Minimum 3-channel float input (224*224*3) for RGB models like OBB.
	 * The scalar model uses 7-channel int8 via the polar path, so this
	 * float path only runs for non-scalar stages with nbits > 8. */
	const size_t min_float_count = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS * 3U;
	const size_t min_float_bytes = min_float_count * sizeof(float);
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_float_count < min_float_count) ||
		(input_len_bytes < min_float_bytes))
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Buffer size mismatch: frame_size=%lu, input_float_count=%lu, input_len_bytes=%lu\r\n", 
						   (unsigned long)frame_size, (unsigned long)input_float_count, (unsigned long)input_len_bytes);
		return false;
	}

	/* Add additional validation for expected frame size */
	const size_t expected_frame_size = source_width * source_height * APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL;
	if (frame_size != expected_frame_size)
	{
		DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Frame size mismatch: expected=%lu, actual=%lu\r\n", 
						   (unsigned long)expected_frame_size, (unsigned long)frame_size);
		/* Continue processing but log the mismatch */
	}

	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";

	/* DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1 emits packed YUYV samples:
	 *   byte 0 = Y0, byte 1 = U, byte 2 = Y1, byte 3 = V, ...
	 * We estimate the gauge position from the bright dial face, crop around
	 * that box, and then map the crop into the model input tensor. */
	if (app_ai_forced_crop_active)
	{
		crop_found = true;
		crop_label = (app_ai_forced_crop_label != NULL)
						 ? app_ai_forced_crop_label
						 : "forced";
		crop_x_min = app_ai_forced_crop_x_min;
		crop_y_min = app_ai_forced_crop_y_min;
		crop_width = app_ai_forced_crop_width;
		crop_height = app_ai_forced_crop_height;
		
		/* Add bounds checking for forced crop */
		if (crop_x_min >= source_width || crop_y_min >= source_height)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Forced crop origin out of bounds: x=%lu, y=%lu, width=%lu, height=%lu\r\n", 
							   (unsigned long)crop_x_min, (unsigned long)crop_y_min, 
							   (unsigned long)source_width, (unsigned long)source_height);
			crop_x_min = 0U;
			crop_y_min = 0U;
			crop_width = source_width;
			crop_height = source_height;
		}
		
