rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		/* Row writer handles both active pixels and padded areas, so we do not
		 * bulk-clear the full tensor up-front. */
		if ((output_float_count * sizeof(float)) > input_len_bytes)
		{
			DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: Output buffer too small: required=%lu, available=%lu\r\n", 
							   (unsigned long)(output_float_count * sizeof(float)), (unsigned long)input_len_bytes);
			return false;
		}

		(void)DebugConsole_WriteString("[AI] Preprocess row loop enter.\r\n");

		for (size_t chunk_start = 0U; chunk_start < output_height;
			 chunk_start += APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK)
		{
			const size_t chunk_end =
				((chunk_start + APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK) < output_height)
					? (chunk_start + APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK)
					: output_height;

			/* Add bounds checking for chunk_end */
			if (chunk_end > output_height)
			{
				DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: chunk_end out of bounds: %lu > %lu\r\n", 
								   (unsigned long)chunk_end, (unsigned long)output_height);
				return false;
			}

			for (size_t out_y = chunk_start; out_y < chunk_end; out_y++)
			{
				/* Add bounds checking for out_y */
				if (out_y >= output_height)
				{
					DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: out_y out of bounds: %lu >= %lu\r\n", 
									   (unsigned long)out_y, (unsigned long)output_height);
					return false;
				}
				
				app_ai_scalar_preprocess_last_row = out_y;

				if (!AppAI_PreprocessScalarRow(frame_bytes, frame_size, source_width,
											 source_height, crop_x_min, crop_y_min,
												crop_width, crop_height, output_width,
													 output_height, resize_scale, resized_width,
													 resized_height, resize_pad_x, resize_pad_y,
													 out_y, input_ptr, input_len_bytes))
				{
					DebugConsole_Printf("[AI] PreprocessYuv422FrameToFloatInput: AppAI_PreprocessScalarRow failed at row %lu\r\n", 
									   (unsigned long)out_y);
					return false;
				}
			}
		}

#if APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
		DebugConsole_WriteString("[AI] Preprocess write summary skipped.\r\n");
#endif /* APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS */
	}

	(void)DebugConsole_WriteString("[AI] Preprocess resize OK.\r\n");

	return true;
}

static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToInt8Input(
	const uint8_t *frame_bytes, size_t frame_size, uint8_t *input_ptr,
	size_t input_len_bytes, const LL_Buffer_InfoTypeDef *input_info)
{
	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t output_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t output_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t required_bytes = output_width * output_height * 3U;
	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";
	float scale_value = 1.0f / 255.0f;
	int16_t zero_point = 0;
	int32_t q_min = -128;
	int32_t q_max = 127;
	int32_t q_zero = 0;

	if ((frame_bytes == NULL) || (input_ptr == NULL) || (input_info == NULL))
	{
		return false;
	}
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_len_bytes < required_bytes))
	{
		return false;
	}

	if (input_info->scale != NULL)
	{
		(void)memcpy(&scale_value, input_info->scale, sizeof(scale_value));
	}
	if (input_info->offset != NULL)
	{
		(void)memcpy(&zero_point, input_info->offset, sizeof(zero_point));
	}
	if (scale_value <= 0.0f)
	{
		scale_value = 1.0f / 255.0f;
	}
	if (input_info->Qunsigned != 0U)
	{
		q_min = 0;
		q_max = 255;
	}
	q_zero = (int32_t)zero_point;
	if (q_zero < q_min)
	{
		q_zero = q_min;
	}
	if (q_zero > q_max)
	{
		q_zero = q_max;
	}

	if (app_ai_forced_crop_active)
	{
		crop_found = true;
		crop_label = (app_ai_forced_crop_label != NULL)
						 ? app_ai_forced_crop_label
						 : "forced";
		crop_x_min = app_ai_forced_crop_x_min;
		crop_y_min = app_ai_forced_crop_y_min;
		crop_width = app_ai_forced_crop_width;
		crop_height = app_ai_forced_crop_height;
	}
	else
	{
#if APP_AI_USE_ADAPTIVE_GAUGE_CROP
		crop_found = AppAI_EstimateGaugeCropBoxFromYuv422(frame_bytes, frame_size,
														  source_width, source_height, &crop_x_min, &crop_y_min,
														  &crop_width, &crop_height);
#endif
		if (crop_found)
		{
			crop_label = "adaptive";
		}
	}
	if (!crop_found)
	{
		crop_x_min = (size_t)((float)source_width * APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_y_min = (size_t)((float)source_height * APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_width = (size_t)((float)source_width * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_height = (size_t)((float)source_height * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_width == 0U)
		{
			crop_width = 1U;
		}
		if (crop_height == 0U)
		{
			crop_height = 1U;
		}
	}

	if (crop_x_min >= source_width)
	{
		crop_x_min = source_width - 1U;
		crop_width = 1U;
	}
	if (crop_y_min >= source_height)
	{
		crop_y_min = source_height - 1U;
		crop_height = 1U;
	}
	if ((crop_x_min + crop_width) > source_width)
	{
		crop_width = source_width - crop_x_min;
	}
	if ((crop_y_min + crop_height) > source_height)
	{
		crop_height = source_height - crop_y_min;
	}

	DebugConsole_Printf("[AI] Crop %s: x=%lu y=%lu w=%lu h=%lu\r\n",
					   crop_label,
					   (unsigned long)crop_x_min, (unsigned long)crop_y_min,
					   (unsigned long)crop_width, (unsigned long)crop_height);
	(void)DebugConsole_WriteString("[AI] Preprocess diagnostics OK.\r\n");
	(void)DebugConsole_WriteString("[AI] Preprocess zero-fill skipped.\r\n");
	(void)DebugConsole_WriteString("[AI] Preprocess resize start.\r\n");

	{
		const float resize_scale =
			fminf((float)output_width / (float)crop_width,
				  (float)output_height / (float)crop_height);
		size_t resized_width = (size_t)(((float)crop_width * resize_scale) + 0.5f);
		size_t resized_height = (size_t)(((float)crop_height * resize_scale) + 0.5f);
		size_t resize_pad_x = 0U;
		size_t resize_pad_y = 0U;

		if (resized_width == 0U)
		{
			resized_width = 1U;
		}
		if (resized_height == 0U)
		{
			resized_height = 1U;
		}
		if (resized_width > output_width)
		{
			resized_width = output_width;
		}
		if (resized_height > output_height)
		{
			resized_height = output_height;
		}
		resize_pad_x = (output_width - resized_width) / 2U;
		resize_pad_y = (output_height - resized_height) / 2U;
		app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;

		if (input_info->Qunsigned != 0U)
		{
			(void)memset(input_ptr, (uint8_t)q_zero, required_bytes);
		}
		else
		{
			const int8_t q_zero_s8 = (int8_t)q_zero;
			for (size_t i = 0U; i < required_bytes; ++i)
			{
				((int8_t *)input_ptr)[i] = q_zero_s8;
			}
		}

		(void)DebugConsole_WriteString("[AI] Preprocess row loop enter.\r\n");

		for (size_t out_y = 0U; out_y < output_height; ++out_y)
		{
			app_ai_scalar_preprocess_last_row = out_y;
			if ((out_y < resize_pad_y) || (out_y >= (resize_pad_y + resized_height)))
			{
				continue;
			}

			for (size_t out_x = 0U; out_x < output_width; ++out_x)
			{
				float out_r = 0.0f;
				float out_g = 0.0f;
				float out_b = 0.0f;
				const size_t base = ((out_y * output_width) + out_x) * 3U;
				if ((out_x < resize_pad_x) || (out_x >= (resize_pad_x + resized_width)))
				{
					continue;
				}
				{
					const float resized_x = (float)(out_x - resize_pad_x);
					const float resized_y = (float)(out_y - resize_pad_y);
					float crop_x = ((resized_x + 0.5f) / resize_scale) - 0.5f;
					float crop_y = ((resized_y + 0.5f) / resize_scale) - 0.5f;

					if (crop_x < 0.0f)
					{
						crop_x = 0.0f;
					}
					else if (crop_x > (float)(crop_width - 1U))
					{
						crop_x = (float)(crop_width - 1U);
					}

					if (crop_y < 0.0f)
					{
						crop_y = 0.0f;
					}
					else if (crop_y > (float)(crop_height - 1U))
					{
						crop_y = (float)(crop_height - 1U);
					}

