rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
					AppAI_ReadRgbFromYuv422Bilinear(
						frame_bytes, frame_size, source_width, source_height,
						(float)crop_x_min + crop_x, (float)crop_y_min + crop_y,
						&out_r, &out_g, &out_b);
				}
				{
					int32_t q_r = (int32_t)lroundf(out_r / scale_value) + (int32_t)zero_point;
					int32_t q_g = (int32_t)lroundf(out_g / scale_value) + (int32_t)zero_point;
					int32_t q_b = (int32_t)lroundf(out_b / scale_value) + (int32_t)zero_point;
					if (q_r < q_min)
						q_r = q_min;
					if (q_r > q_max)
						q_r = q_max;
					if (q_g < q_min)
						q_g = q_min;
					if (q_g > q_max)
						q_g = q_max;
					if (q_b < q_min)
						q_b = q_min;
					if (q_b > q_max)
						q_b = q_max;

					if (input_info->Qunsigned != 0U)
					{
						input_ptr[base + 0U] = (uint8_t)q_r;
						input_ptr[base + 1U] = (uint8_t)q_g;
						input_ptr[base + 2U] = (uint8_t)q_b;
					}
					else
					{
						((int8_t *)input_ptr)[base + 0U] = (int8_t)q_r;
						((int8_t *)input_ptr)[base + 1U] = (int8_t)q_g;
						((int8_t *)input_ptr)[base + 2U] = (int8_t)q_b;
					}
				}
			}
		}
	}
#endif

	(void)DebugConsole_WriteString("[AI] Preprocess resize OK.\r\n");
	return true;
}

/* V28 polar-vote preprocessing: YUV422 -> 224x224x7 int8 polar input.
 *
 * Channels 0-2: polar-projected RGB (normalized 0-1, mapped to int8).
 * Channels 3-5: Sobel edge channels on polar luma (angular, radial gradients).
 * Channel 6: vote prior (weighted darkness + edge evidence with radial mask).
 *
 * Polar projection maps each (row, col) in the 224x224 output to source (x, y):
 *   angle = 2 * pi * col / 224
 *   radius = (row / 224) * max_radius
 *   source_y = center_y - radius * sin(angle)   [Y axis inverted]

 *
 * Sobel edges are computed on the polar luma:
 *   Channel 4: |dI/dtheta| (horizontal Sobel = angular derivative)
 *   Channel 5: |dI/dr|     (vertical Sobel = radial derivative)
 *   Each normalized by its 99th percentile.
 *
 * Input quantisation: float [0,1] -> int8 via q = round(x*255) - 128, clamped [-128, 127].
 */
static float __attribute__((noinline)) AppAI_ScorePolarAlignmentCandidate(
	const uint8_t *resized_rgb,
	size_t output_dim,
	float center_x,
	float center_y,
	float max_radius,
	uint8_t *polar_luma_out)
{
	const float two_pi = 2.0f * 3.14159265358979323846f;
	const size_t bins = (size_t)APP_AI_POLAR_VOTE_BINS;
	uint32_t luma_hist[256U] = {0U};
	const uint32_t total_luma_samples = (uint32_t)(output_dim * output_dim);
	const float row_denominator = (output_dim > 1U) ? (float)(output_dim - 1U) : 1.0f;
	float continuity_sum = 0.0f;

	if ((resized_rgb == NULL) || (polar_luma_out == NULL) || (output_dim == 0U))
	{
		return 0.0f;
	}

	for (size_t row = 0U; row < output_dim; ++row)
	{
		for (size_t col = 0U; col < output_dim; ++col)
		{
			const float angle = two_pi * (float)col / (float)bins;
			const float radius = ((float)row / (float)output_dim) * max_radius;
			const float src_x = center_x + (radius * cosf(angle));
			const float src_y = center_y - (radius * sinf(angle));
			float out_r = 0.0f;
			float out_g = 0.0f;
			float out_b = 0.0f;
			float luma_f = 0.0f;
			int32_t luma_q = 0;

			if ((src_x >= 0.0f) && (src_x < (float)output_dim) &&
			    (src_y >= 0.0f) && (src_y < (float)output_dim))
			{
				AppAI_ReadRgbFromRgbBilinear(
					resized_rgb, output_dim, output_dim,
					src_x, src_y, &out_r, &out_g, &out_b);
			}

			luma_f = (0.299f * out_r) + (0.587f * out_g) + (0.114f * out_b);
			luma_q = (int32_t)lroundf(luma_f * 255.0f);
			if (luma_q < 0)
			{
				luma_q = 0;
			}
			else if (luma_q > 255)
			{
				luma_q = 255;
			}

			polar_luma_out[row * output_dim + col] = (uint8_t)luma_q;
			luma_hist[(uint8_t)luma_q]++;
		}
	}

	{
		const uint8_t luma_threshold = AppAI_FindHistogramPercentile(
			luma_hist, 256U, total_luma_samples, 0.38f);

		for (size_t col = 0U; col < output_dim; ++col)
		{
			const float radial_mask_column = 1.0f;
			float best_run = 0.0f;
			float run = 0.0f;
			for (size_t row = 0U; row < output_dim; ++row)
			{
				const float row_position = (float)row / row_denominator;
				const float radial_mask =
					((row_position >= 0.18f) && (row_position <= 0.95f)) ? radial_mask_column : 0.0f;
				const uint8_t luma_q = polar_luma_out[row * output_dim + col];
				if ((radial_mask > 0.5f) && (luma_q <= luma_threshold))
				{
					run += 1.0f;
					if (run > best_run)
					{
						best_run = run;
					}
				}
				else
				{
					run = 0.0f;
				}
			}
			continuity_sum += best_run;
		}
	}

	{
		const uint32_t total_cells = (uint32_t)(output_dim * bins);
		return continuity_sum / (float)((total_cells > 0U) ? total_cells : 1U);
	}
}

static bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToPolarInput(
	const uint8_t *frame_bytes, size_t frame_size,
	uint8_t *input_ptr, size_t input_len_bytes,
	const LL_Buffer_InfoTypeDef *input_info)
{
	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t output_dim = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t channels = 7U;
	const size_t required_bytes = output_dim * output_dim * channels;
	const float two_pi = 2.0f * 3.14159265358979323846f;
	const size_t bins = (size_t)APP_AI_POLAR_VOTE_BINS;

	/* Polar projection center and radius in the resized 224x224 coordinate
	 * space (matching the training pipeline crop -> resize_with_pad -> polar
	 * flow).  The inverse resize_with_pad transform maps each polar pixel
	 * back to the correct source frame coordinate. */
	float center_x = 0.0f;
	float center_y = 0.0f;
	float max_radius = 0.0f;
	float resize_scale = 1.0f;   /* 224 / max(crop_w, crop_h) */
	float pad_x_f = 0.0f;       /* horizontal padding in resized space */
	float pad_y_f = 0.0f;       /* vertical padding in resized space */
	float crop_x_min_f = 0.0f;  /* crop origin in frame coords */
	float crop_y_min_f = 0.0f;
	float crop_width_f = 0.0f;   /* crop dims needed for padded-area check */
	float crop_height_f = 0.0f;
	float resized_w = 0.0f;     /* crop dims after resize_with_pad (in 224 space) */
	float resized_h = 0.0f;
	/* Scratch for polar luma plane: 224x224 uint8 (~49 KB in BSS).
	 * Stores quantised luma as uint8 [0..255] instead of float [0..1]
	 * to save ~148 KB per plane.  Gradients are recomputed on-the-fly
	 * in a second pass instead of being stored in separate arrays,
	 * eliminating two ~197 KB float arrays (~394 KB total savings). */
	static uint8_t resized_rgb[224U * 224U * 3U] __attribute__((section(".npusram6"))); /* training-style resized crop */
	static uint8_t polar_luma[224U * 224U] __attribute__((section(".npusram6")));  /* exact V28 polar luma scratch */

	if ((frame_bytes == NULL) || (input_ptr == NULL) || (input_info == NULL))
	{
		return false;
	}
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_len_bytes < required_bytes))
	{
		DebugConsole_Printf(
			"[AI] PolarInput: buffer size mismatch frame=%lu input=%lu required=%lu\r\n",
			(unsigned long)frame_size, (unsigned long)input_len_bytes,
			(unsigned long)required_bytes);
		return false;
	}

	/* Determine crop region from forced crop or training defaults. */
	{
		size_t crop_x_min = 0U;
		size_t crop_y_min = 0U;
		size_t crop_width = source_width;
		size_t crop_height = source_height;

