rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		if (app_ai_forced_crop_active)
		{
			crop_x_min = app_ai_forced_crop_x_min;
			crop_y_min = app_ai_forced_crop_y_min;
			crop_width = app_ai_forced_crop_width;
			crop_height = app_ai_forced_crop_height;
		}
		else
		{
			/* Use the training crop ratios as defaults. */
			crop_x_min = (size_t)((float)source_width * APP_AI_TRAINING_CROP_X_MIN_RATIO);
			crop_y_min = (size_t)((float)source_height * APP_AI_TRAINING_CROP_Y_MIN_RATIO);
			crop_width = (size_t)((float)source_width * (APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO));
			crop_height = (size_t)((float)source_height * (APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		}

		/* Clamp crop to frame bounds. */
		if (crop_x_min >= source_width)
		{
			crop_x_min = source_width - 1U;
			crop_width = 1U;
		}
		if (crop_y_min >= source_height)
		{
			crop_y_min = source_height - 1U;
			crop_height = 1U;
		}
		if ((crop_x_min + crop_width) > source_width)
		{
			crop_width = source_width - crop_x_min;
		}
		if ((crop_y_min + crop_height) > source_height)
		{
			crop_height = source_height - crop_y_min;
		}

		/* Training pipeline: crop -> tf.image.resize_with_pad(224x224) ->
		 * polar(center=112,112, r=112).  We replicate this by computing
		 * the inverse resize_with_pad transform so each polar pixel maps
		 * back to the correct source frame coordinate. */
		crop_x_min_f = (float)crop_x_min;
		crop_y_min_f = (float)crop_y_min;
		crop_width_f = (float)crop_width;
		crop_height_f = (float)crop_height;
		resize_scale = 224.0f / fmaxf(crop_width_f, crop_height_f);
		resized_w = crop_width_f * resize_scale;
		resized_h = crop_height_f * resize_scale;
		pad_x_f = (224.0f - resized_w) * 0.5f;
		pad_y_f = (224.0f - resized_h) * 0.5f;
		/* Polar center and max_radius in the resized 224x224 space. */
		center_x = 112.0f;
		center_y = 112.0f;
		max_radius = 112.0f;

		/* newlib-nano does not support %f in printf; use integer formatting. */
		{
			const long scale_milli = (long)(resize_scale * 1000.0f + 0.5f);
			const long padx_milli = (long)(pad_x_f * 1000.0f + 0.5f);
			const long pady_milli = (long)(pad_y_f * 1000.0f + 0.5f);
			DebugConsole_Printf("[AI] Polar crop: cx=%ld cy=%ld r=%ld scale=%ld.%03ld pad=(%ld.%03ld,%ld.%03ld)\r\n",
				(long)center_x, (long)center_y, (long)max_radius,
				scale_milli / 1000L, scale_milli % 1000L,
				padx_milli / 1000L, padx_milli % 1000L,
				pady_milli / 1000L, pady_milli % 1000L);
		}
	}

	/* Step 1: build the resized 224x224 crop exactly like the offline
	 * resize_with_pad path, using a temporary uint8 RGB buffer. */
	(void)memset(input_ptr, 0, required_bytes);
	(void)memset(resized_rgb, 0, sizeof(resized_rgb));
	(void)memset(polar_luma, 0, sizeof(polar_luma));

	for (size_t out_y = 0U; out_y < output_dim; ++out_y)
	{
		for (size_t out_x = 0U; out_x < output_dim; ++out_x)
		{
			const float resized_x = (float)out_x;
			const float resized_y = (float)out_y;
			uint8_t out_r = 0U;
			uint8_t out_g = 0U;
			uint8_t out_b = 0U;

			if ((resized_x >= pad_x_f) && (resized_x < (pad_x_f + resized_w)) &&
			    (resized_y >= pad_y_f) && (resized_y < (pad_y_f + resized_h)))
			{
				float crop_x = ((resized_x + 0.5f) / resize_scale) - 0.5f;
				float crop_y = ((resized_y + 0.5f) / resize_scale) - 0.5f;
				if (crop_x < 0.0f)
				{
					crop_x = 0.0f;
				}
				else if (crop_x > (crop_width_f - 1.0f))
				{
					crop_x = crop_width_f - 1.0f;
				}
				if (crop_y < 0.0f)
				{
					crop_y = 0.0f;
				}
				else if (crop_y > (crop_height_f - 1.0f))
				{
					crop_y = crop_height_f - 1.0f;
				}

				const float total_crop_x = crop_x_min_f + crop_x;
				const float total_crop_y = crop_y_min_f + crop_y;
				float sample_r = 0.0f;
				float sample_g = 0.0f;
				float sample_b = 0.0f;

				AppAI_ReadRgbFromYuv422Bilinear(
					frame_bytes, frame_size, source_width, source_height,
					total_crop_x, total_crop_y,
					&sample_r, &sample_g, &sample_b);

				out_r = (uint8_t)lroundf(sample_r * 255.0f);
				out_g = (uint8_t)lroundf(sample_g * 255.0f);
				out_b = (uint8_t)lroundf(sample_b * 255.0f);
			}

			{
				const size_t base = (out_y * output_dim + out_x) * 3U;
				resized_rgb[base + 0U] = out_r;
				resized_rgb[base + 1U] = out_g;
				resized_rgb[base + 2U] = out_b;
			}
		}
	}

	/* Step 1.5: search a small 3x3 neighborhood around the nominal polar
	 * pivot. This matches the offline V28 helper and keeps the live needle
	 * vote from drifting when the crop lands a few pixels off-center. */
	{
		const int32_t offsets[] = {
			0,
			-(int32_t)APP_AI_POLAR_CENTER_SEARCH_PIXELS,
			(int32_t)APP_AI_POLAR_CENTER_SEARCH_PIXELS,
		};
		float best_score = -1.0f;
		float best_center_x = center_x;
		float best_center_y = center_y;

		for (size_t idx_y = 0U; idx_y < (sizeof(offsets) / sizeof(offsets[0])); ++idx_y)
		{
			for (size_t idx_x = 0U; idx_x < (sizeof(offsets) / sizeof(offsets[0])); ++idx_x)
			{
				const float candidate_center_x = center_x + (float)offsets[idx_x];
				const float candidate_center_y = center_y + (float)offsets[idx_y];
				const float candidate_score = AppAI_ScorePolarAlignmentCandidate(
					resized_rgb,
					output_dim,
					candidate_center_x,
					candidate_center_y,
					max_radius,
					polar_luma);
				if (candidate_score > best_score)
				{
					best_score = candidate_score;
					best_center_x = candidate_center_x;
					best_center_y = candidate_center_y;
				}
			}
		}

		center_x = best_center_x;
		center_y = best_center_y;

		{
			char search_log[128];
			const long score_milli = (long)(best_score * 1000.0f + 0.5f);
			(void)DebugConsole_Snprintf(
				search_log,
				sizeof(search_log),
				"[AI] Polar center search: best=(%ld,%ld) score=%ld.%03ld\r\n",
				(long)center_x,
				(long)center_y,
				score_milli / 1000L,
				labs(score_milli % 1000L));
			(void)DebugConsole_WriteString(search_log);
		}
	}

	/* Step 2: polar-project the resized crop into the live 7-channel tensor. */
	{
		for (size_t row = 0U; row < output_dim; ++row)
		{
			for (size_t col = 0U; col < output_dim; ++col)
			{
				const float angle = two_pi * (float)col / (float)bins;
				const float radius = ((float)row / (float)output_dim) * max_radius;
				const float src_x = center_x + radius * cosf(angle);
				const float src_y = center_y - radius * sinf(angle);
				float out_r = 0.0f;
				float out_g = 0.0f;
				float out_b = 0.0f;

				if ((src_x >= 0.0f) && (src_x < (float)output_dim) &&
				    (src_y >= 0.0f) && (src_y < (float)output_dim))
				{
					AppAI_ReadRgbFromRgbBilinear(
						resized_rgb, output_dim, output_dim,
						src_x, src_y, &out_r, &out_g, &out_b);
				}

				{
					const size_t base = (row * output_dim + col) * channels;
					int32_t q_r = (int32_t)lroundf(out_r * 255.0f) - 128;
					int32_t q_g = (int32_t)lroundf(out_g * 255.0f) - 128;
					int32_t q_b = (int32_t)lroundf(out_b * 255.0f) - 128;
					if (q_r < -128) q_r = -128;
					if (q_r > 127) q_r = 127;
					if (q_g < -128) q_g = -128;
					if (q_g > 127) q_g = 127;
					if (q_b < -128) q_b = -128;
					if (q_b > 127) q_b = 127;
					((int8_t *)input_ptr)[base + 0U] = (int8_t)q_r;
					((int8_t *)input_ptr)[base + 1U] = (int8_t)q_g;
					((int8_t *)input_ptr)[base + 2U] = (int8_t)q_b;
				}

				{
					const float luma_f = 0.299f * out_r + 0.587f * out_g + 0.114f * out_b;
					int32_t luma_q = (int32_t)lroundf(luma_f * 255.0f);
					if (luma_q < 0) luma_q = 0;
					if (luma_q > 255) luma_q = 255;
					polar_luma[row * output_dim + col] = (uint8_t)luma_q;
				}
			}
		}
	}

	/* Step 3: derive edge and vote channels from the polar luma plane using
	 * the same percentile/continuity logic as the offline V28 pipeline. */
	{
		uint32_t angular_hist[256U] = {0U};
		uint32_t radial_hist[256U] = {0U};
		uint32_t luma_hist[256U] = {0U};
		float sum_evidence[APP_AI_POLAR_VOTE_BINS] = {0.0f};
		float continuity[APP_AI_POLAR_VOTE_BINS] = {0.0f};
		float score[APP_AI_POLAR_VOTE_BINS] = {0.0f};
		const uint32_t total_luma_samples = (uint32_t)(output_dim * output_dim);
		const uint32_t total_gradient_samples = (uint32_t)((output_dim - 2U) * output_dim);
		const float row_denominator = (output_dim > 1U) ? (float)(output_dim - 1U) : 1.0f;
		uint32_t radial_mask_rows = 0U;

		for (size_t row = 0U; row < output_dim; ++row)
		{
			for (size_t col = 0U; col < output_dim; ++col)
			{
				luma_hist[polar_luma[row * output_dim + col]]++;
			}
		}

