rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	if (y_index >= frame_size_bytes || u_index >= frame_size_bytes || v_index >= frame_size_bytes)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Pixel: Individual indices out of bounds: y=%lu, u=%lu, v=%lu, frame_size=%lu\r\n", 
						   (unsigned long)y_index, (unsigned long)u_index, (unsigned long)v_index, 
						   (unsigned long)frame_size_bytes);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	const float y = ((float)frame_bytes[y_index] - 16.0f) * 1.1643836f;
	const float u = (float)frame_bytes[u_index] - 128.0f;
	const float v = (float)frame_bytes[v_index] - 128.0f;
	const float r = (y + (1.5960268f * v)) / 255.0f;
	const float g = (y - (0.3917623f * u) - (0.8129677f * v)) / 255.0f;
	const float b = (y + (2.0172322f * u)) / 255.0f;
#endif

	if (r_out != NULL)
	{
		*r_out = AppAI_ClampNormalizedFloat(r);
	}
	if (g_out != NULL)
	{
		*g_out = AppAI_ClampNormalizedFloat(g);
	}
	if (b_out != NULL)
	{
		*b_out = AppAI_ClampNormalizedFloat(b);
	}
}

static void AppAI_ReadRgbFromYuv422Bilinear(const uint8_t *frame_bytes,
											size_t frame_size_bytes,
											size_t frame_width_pixels,
											size_t frame_height_pixels,
											float source_x, float source_y,
											float *r_out, float *g_out, float *b_out)
{
	/* Add additional bounds checking and validation */
	if ((frame_bytes == NULL) || (frame_size_bytes < 4U) ||
		(frame_width_pixels == 0U) || (frame_height_pixels == 0U))
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: Invalid parameters\r\n");
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	/* Add bounds checking for source coordinates */
	if (source_x < 0.0f || source_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: Negative coordinates: x=%f, y=%f\r\n", 
						   (double)source_x, (double)source_y);
		source_x = (source_x < 0.0f) ? 0.0f : source_x;
		source_y = (source_y < 0.0f) ? 0.0f : source_y;
	}

	const float max_x = (frame_width_pixels > 0U) ? (float)(frame_width_pixels - 1U)
												 : 0.0f;
	const float max_y = (frame_height_pixels > 0U) ? (float)(frame_height_pixels - 1U)
												  : 0.0f;

	/* Add additional validation for max values */
	if (max_x < 0.0f || max_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: Invalid max values: max_x=%f, max_y=%f\r\n", 
						   (double)max_x, (double)max_y);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	float clamped_x = source_x;
	float clamped_y = source_y;
	float r00 = 0.0f;
	float g00 = 0.0f;
	float b00 = 0.0f;
	float r10 = 0.0f;
	float g10 = 0.0f;
	float b10 = 0.0f;
	float r01 = 0.0f;
	float g01 = 0.0f;
	float b01 = 0.0f;
	float r11 = 0.0f;
	float g11 = 0.0f;
	float b11 = 0.0f;

	if (clamped_x > max_x)
	{
		clamped_x = max_x;
	}

	if (clamped_y > max_y)
	{
		clamped_y = max_y;
	}

	/* Add additional validation for clamped coordinates */
	if (clamped_x < 0.0f || clamped_y < 0.0f)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: Clamped coordinates negative: x=%f, y=%f\r\n", 
						   (double)clamped_x, (double)clamped_y);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	const size_t x0 = (size_t)floorf(clamped_x);
	const size_t y0 = (size_t)floorf(clamped_y);
	
	/* Add bounds checking for x0 and y0 */
	if (x0 >= frame_width_pixels || y0 >= frame_height_pixels)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: x0/y0 out of bounds: x0=%lu, y0=%lu, width=%lu, height=%lu\r\n", 
						   (unsigned long)x0, (unsigned long)y0, 
						   (unsigned long)frame_width_pixels, (unsigned long)frame_height_pixels);
		if (r_out != NULL)
		{
			*r_out = 0.0f;
		}
		if (g_out != NULL)
		{
			*g_out = 0.0f;
		}
		if (b_out != NULL)
		{
			*b_out = 0.0f;
		}
		return;
	}

	const size_t x1 = (x0 + 1U < frame_width_pixels) ? (x0 + 1U) : x0;
	const size_t y1 = (y0 + 1U < frame_height_pixels) ? (y0 + 1U) : y0;
	const float fx = clamped_x - (float)x0;
	const float fy = clamped_y - (float)y0;
	
	/* Add bounds checking for fx and fy */
	if (fx < 0.0f || fx > 1.0f || fy < 0.0f || fy > 1.0f)
	{
		DebugConsole_Printf("[AI] ReadRgbFromYuv422Bilinear: Invalid fx/fy: fx=%f, fy=%f\r\n", 
						   (double)fx, (double)fy);
	}

	/* Add bounds checking for AppAI_ReadRgbFromYuv422Pixel calls */
	AppAI_ReadRgbFromYuv422Pixel(frame_bytes, frame_size_bytes, frame_width_pixels,
								 x0, y0, &r00, &g00, &b00);
	AppAI_ReadRgbFromYuv422Pixel(frame_bytes, frame_size_bytes, frame_width_pixels,
								 x1, y0, &r10, &g10, &b10);
	AppAI_ReadRgbFromYuv422Pixel(frame_bytes, frame_size_bytes, frame_width_pixels,
								 x0, y1, &r01, &g01, &b01);
	AppAI_ReadRgbFromYuv422Pixel(frame_bytes, frame_size_bytes, frame_width_pixels,
								 x1, y1, &r11, &g11, &b11);

	if (r_out != NULL)
	{
		const float top_r = r00 + (fx * (r10 - r00));
		const float bottom_r = r01 + (fx * (r11 - r01));
		*r_out = AppAI_ClampNormalizedFloat(top_r + (fy * (bottom_r - top_r)));
	}

	if (g_out != NULL)
	{
		const float top_g = g00 + (fx * (g10 - g00));
		const float bottom_g = g01 + (fx * (g11 - g01));
		*g_out = AppAI_ClampNormalizedFloat(top_g + (fy * (bottom_g - top_g)));
	}

	if (b_out != NULL)
	{
		const float top_b = b00 + (fx * (b10 - b00));
		const float bottom_b = b01 + (fx * (b11 - b01));
		*b_out = AppAI_ClampNormalizedFloat(top_b + (fy * (bottom_b - top_b)));
	}
}

static void AppAI_ReadRgbFromRgbBilinear(const uint8_t *rgb_bytes,
										size_t frame_width_pixels,
										size_t frame_height_pixels,
										float source_x, float source_y,
										float *r_out, float *g_out, float *b_out)
{
	if ((rgb_bytes == NULL) || (frame_width_pixels == 0U) || (frame_height_pixels == 0U))
	{
		if (r_out != NULL) { *r_out = 0.0f; }
		if (g_out != NULL) { *g_out = 0.0f; }
		if (b_out != NULL) { *b_out = 0.0f; }
		return;
	}

	if (source_x < 0.0f)
	{
		source_x = 0.0f;
	}
	if (source_y < 0.0f)
	{
		source_y = 0.0f;
	}

	const float max_x = (frame_width_pixels > 0U) ? (float)(frame_width_pixels - 1U) : 0.0f;
	const float max_y = (frame_height_pixels > 0U) ? (float)(frame_height_pixels - 1U) : 0.0f;
	float clamped_x = source_x;
	float clamped_y = source_y;
	if (clamped_x > max_x)
	{
		clamped_x = max_x;
	}
	if (clamped_y > max_y)
	{
		clamped_y = max_y;
	}

	const size_t x0 = (size_t)floorf(clamped_x);
	const size_t y0 = (size_t)floorf(clamped_y);
	const size_t x1 = (x0 + 1U < frame_width_pixels) ? (x0 + 1U) : x0;
	const size_t y1 = (y0 + 1U < frame_height_pixels) ? (y0 + 1U) : y0;
	const float fx = clamped_x - (float)x0;
	const float fy = clamped_y - (float)y0;

	const size_t base00 = ((y0 * frame_width_pixels) + x0) * 3U;
	const size_t base10 = ((y0 * frame_width_pixels) + x1) * 3U;
	const size_t base01 = ((y1 * frame_width_pixels) + x0) * 3U;
	const size_t base11 = ((y1 * frame_width_pixels) + x1) * 3U;

