rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	const float r00 = ((float)rgb_bytes[base00 + 0U]) / 255.0f;
	const float g00 = ((float)rgb_bytes[base00 + 1U]) / 255.0f;
	const float b00 = ((float)rgb_bytes[base00 + 2U]) / 255.0f;
	const float r10 = ((float)rgb_bytes[base10 + 0U]) / 255.0f;
	const float g10 = ((float)rgb_bytes[base10 + 1U]) / 255.0f;
	const float b10 = ((float)rgb_bytes[base10 + 2U]) / 255.0f;
	const float r01 = ((float)rgb_bytes[base01 + 0U]) / 255.0f;
	const float g01 = ((float)rgb_bytes[base01 + 1U]) / 255.0f;
	const float b01 = ((float)rgb_bytes[base01 + 2U]) / 255.0f;
	const float r11 = ((float)rgb_bytes[base11 + 0U]) / 255.0f;
	const float g11 = ((float)rgb_bytes[base11 + 1U]) / 255.0f;
	const float b11 = ((float)rgb_bytes[base11 + 2U]) / 255.0f;

	if (r_out != NULL)
	{
		const float top_r = r00 + (fx * (r10 - r00));
		const float bottom_r = r01 + (fx * (r11 - r01));
		*r_out = AppAI_ClampNormalizedFloat(top_r + (fy * (bottom_r - top_r)));
	}
	if (g_out != NULL)
	{
		const float top_g = g00 + (fx * (g10 - g00));
		const float bottom_g = g01 + (fx * (g11 - g01));
		*g_out = AppAI_ClampNormalizedFloat(top_g + (fy * (bottom_g - top_g)));
	}
	if (b_out != NULL)
	{
		const float top_b = b00 + (fx * (b10 - b00));
		const float bottom_b = b01 + (fx * (b11 - b01));
		*b_out = AppAI_ClampNormalizedFloat(top_b + (fy * (bottom_b - top_b)));
	}
}

static uint8_t AppAI_FindHistogramPercentile(const uint32_t *histogram,
											 size_t histogram_len,
											 uint32_t total_count,
											 float percentile)
{
	uint32_t target = 0U;
	uint32_t cumulative = 0U;
	size_t bin = 0U;

	if ((histogram == NULL) || (histogram_len == 0U) || (total_count == 0U))
	{
		return 0U;
	}

	if (percentile < 0.0f)
	{
		percentile = 0.0f;
	}
	if (percentile > 1.0f)
	{
		percentile = 1.0f;
	}

	target = (uint32_t)ceilf(percentile * (float)total_count);
	if (target == 0U)
	{
		target = 1U;
	}

	for (bin = 0U; bin < histogram_len; ++bin)
	{
		cumulative += histogram[bin];
		if (cumulative >= target)
		{
			return (uint8_t)bin;
		}
	}

	return (uint8_t)(histogram_len - 1U);
}

bool App_AI_GetLastInferenceResult(float *value_out)
{
	if (value_out == NULL)
	{
		return false;
	}
	if (!app_ai_last_inference_valid)
	{
		return false;
	}
	if (!AppAI_IsFiniteFloat(app_ai_last_inference_value))
	{
		return false;
	}
	if (!AppAI_IsPlausibleInferenceValue(app_ai_last_inference_value))
	{
		return false;
	}
	*value_out = app_ai_last_inference_value;
	return true;
}

/* USER CODE END 1 */
